[
    {
        "codigo": "CIC0004",
        "nome": "ALGORITMOS E PROGRAMAÇÃO DE COMPUTADORES",
        "ementa": "Princípios fundamentais de construção de programas. Construção de algoritmos e sua representação em pseudocódigo e linguagens de alto nível. Noções de abstração. Especificação de variáveis e funções. Testes e depuração. Padrões de soluções em programação. Noções de programação estruturada. Identificadores e tipos. Operadores e expressões. Estruturas de controle: condicional e repetição. Entrada e saída de dados. Estruturas de dados estáticas: agregados homogêneos e heterogêneos. Iteração e recursão. Noções de análise de custo e complexidade. Desenvolvimento sistemático e implementação de programas. Estruturação, depuração, testes e documentação de programas. Resolução de problemas. Aplicações em casos reais e questões ambientais.",
        "conteudo": ""
    },
    {
        "codigo": "IFD0171",
        "nome": "FISICA 1",
        "ementa": "Módulos 1: Unidades e grandezas físicas 2: Vetores 3: Movimento retilineo 4: Movimento em duas e três dimensoes 5: Leis de Newton do movimento 6: Aplicação das Leis de Newton 7: Trabalho e Energia Cinetica ´ 8: Energia potencial e conservação de energia 9: Momento linear e impulso 10: Colisões 11: Rotação de corpos rígidos 12:Dinamica do movimento de rotação.",
        "conteudo": "I-MEDICAO: GRANDEZAS, PADROES E UNIDADES FISICAS. O SISTEMA INTERNACIONAL DE UNIDADES. PADRAO DE COMPRIMENTO, MASSA E TEMPO. II-VETORES: CARACTERIZACAO DE GRANDEZA VETORIAL. VETORES UNITARIOS. OPERACOES COM VETORES. III-CINEMATICA DA PARTICULA: CONSIDERACOES ENVOLVIDAS NA CINEMATICA DA PARTICULA. CONCEITO DE DIFERENCIACAO E SUA APLICACAO A PROPBLEMAS DE MECANICA. EQUACOES DE MOVIMENTO. REPRESENTACAO VETORIAL. MOVIMENTO CIRCULAR UNIFORME. VELOCIDADE E ACELARACAO RELATIVAS. IV-DINAMICA DA PARTICULA: A PRIMEIRA LEI DE NEWTON. OS CONCEITOS DE FORCA E MASSA. A SEGUNDA LEI DE NEWTON. A TERCEIRA LEI DE NEWTON. SISTEMAS DE UNIDADES. FORCAS DE ATRITO. DINAMICA DO MOVIMENTO CIRCULAR UNIFORME. CLASSIFICACAO DAS FORCAS. MECANICA CLASSICA, RELATIVISTICA E QUANTICA. V-TRABALHO E ENERGIA. CONSERVACAO DA ENERGIA. TRABALHO REALIZADO POR UMA FORCA CONSTANTE. CONCEITO DE INTEGRACAO E SUA APLICACAO A PROBLEMAS EM MECANICA. TRABALHO REALIZADO POR FORCA VARIAVEL. ENERGIA CINETICA. TEOREMA TRABALHO-ENERGIA-POTENCIA. FORCAS CONSERVATIVAS E NAO CONSER VATIVAS. ENERGIA POTENCIAL. CONSERVACAO DE ENERGIA. MASSA E ENERGIA. VI-CONSERVACAO DO MOMENTO LINEAR: CENTRO DE MASSA E SEU MOVIMENTO. MOVIMENTO LINERAR. CONSERVACAO DO MOMENTO LINEAR. SISTEMAS DE MASSA VARIAVEL. VII-COLISOES: CONCEITO DE COLISAO. IMPULSO E MOMENTO LINEAR. CONSERVACAO DO MOMEN: TO LINEAR DURANTE AS COLISOES. SECAO EFICAZ DE CHOQUE. VIII-CINEMATICA DE ROTACAO : AS VARIAVEIS DA CINEMATICA DA ROTACAO. ROTACAO COM ACELERACAO ANGULAR CONSTANTE. GRANDEZAS VETORIAIS NA ROTACAO. RELACAO ENTRE CINEMATICA LINEAR E ANGULAR DE UMA PARTICULA EM MOVIMENTO CIRCULAR.IX-EQUILIBRIO DE CORPOS RIGIDOS: CONCEITO DE CORPO RIGIDO. EQUILIBRIO. CENTRO DE GRAVIDADE. EQUILIBRIO DE CORPOS RIGIDOS NA PRESENCA DO CAMPO GRAVITACIONAL."
    },
    {
        "codigo": "IFD0173",
        "nome": "FISICA 1 EXPERIMENTAL",
        "ementa": "MEDIDAS E ERROS. ANALISE GRAFICA. ATRITO. COLISAO. CONSERVACAO DO MOMENTO LINEAR. ESTUDO DOS MOVIMENTOS. ROTACAO. CONSERVACAO DE ENERGIA. EQUILIBRIO DE CORPOS RIGIDOS.",
        "conteudo": "I-CLASSIFICACAO DOS ERROS. CALCULO DE ERRO EXPERIMENTAL, ALGARISMOS SIGNIFICATIVOS. PROPAGACAO DE ERROS. MEDIDAS COM INSTRUMENTOS DE PRECISAO. II-CONSTRUCAO E ANALISE DE GRAFICOS. GRAFICOS LINEARES, MONO-LOG E LOG-LOG. III-MOVIMENTO NO PLANO INCLINADO. COEFICIENTE DE ATRITO. COEFICIENTE DERESTITUICAO PARA COLISOES. TIPOS DE COLISOES. IV-CONSERVACAO DO MOMENTO LINEAR EM COLISOES, UNIDIMENSIONAIS E BI-DIMENSIONAIS. CONSERVACAO DA ENERGIA. V-ESTUDO DO EQUILIBRIO DE CORPOS RIGIDOS. DIAGRAMAS DE FORCAS."
    },
    {
        "codigo": "MAT0025",
        "nome": "CÁLCULO 1",
        "ementa": "Funções de uma variável real, limite e continuidade, derivada, integral, aplicações da integral.",
        "conteudo": "1. Funções: conceito de função exemplo de funções de uma variável real tipos de funções gráficos função composta função inversa funções trigonométricas e suas inversas função exponencial função logaritmo2. Limite e continuidade: conceito de limite propriedades dos limites limites laterais limites envolvendo o infinito continuidade Teorema do Valor Intermediário3. Derivadas: conceito de derivada reta tangente e reta normal derivadas laterais regras básicas de derivação regra da cadeia taxas relacionadas derivada da função inversa derivação implícita comportamento de funções máximos e mínimos Teorema do Valor Médio regras de l?Hospital concavidade, inflexão e gráficos problemas de otimização4. Integrais: primitivas integrais indefinidas e suas propriedades integral definida e suas propriedades Teorema Fundamental do Cálculo integração por substituição integração por partes integração por frações parciais integração de produtos de funções trigonométricas integração por substituição inversa integração por substituições especiais.5. Aplicações da integral: aplicações da integral ao cálculo de áreas planas, comprimento de curvas, volumes e áreas de sólidos."
    },
    {
        "codigo": "ENM0133",
        "nome": "INTRODUCAO A ENGENHARIA MECATRONICA",
        "ementa": "A Universidade de Brasília. Engenharia, Controle e Automação, e as Diretrizes Curriculares Nacionais. Estrutura curricular do curso. Atividades Extracurriculares. Palestras motivadoras.",
        "conteudo": ""
    },
    {
        "codigo": "IQD0125",
        "nome": "QUIMICA GERAL TEORICA",
        "ementa": "Abordagem conceitual dos princípios fundamentais da Química e suas aplicações, usando exemplo de compostos orgânicos e inorgânicos. Ênfase à interface da Química com as diversas áreas do conhecimento. Introdução ao trabalho em laboratório de química. Observação e interpretação de fenômenos químicos através da realização de experimentos representativos que correlacionem o aspecto conceitual à vida cotidiana de uma maneira estimulante.",
        "conteudo": "1.Estrutura Atômica e a Lei Periódica: O Modelo da Radiação Eletromagnética e o Espectro Atômico Evolução Histórica do Modelo Atômico O Modelo de Bohr do Átomo de Hidrogênio A Mecânica Quântica Configuração Eletrônica dos Elementos e a Tabela Periódica.2.Ligação Química e Estrutura Molecular: Estruturas de Lewis O Modelo VSEPR A Ligação Covalente e suas Propriedades (comprimento, energia e polaridade) Estruturas Moleculares (Teoria da Ligação de Valência, Teoria dos Orbitais Híbridos e Teoria dos Orbitais Moleculares).3.Matéria: Classificação da Matéria Estados Físicos da Matéria (Forças Intermoleculares e Propriedades Físicas: PE, PF, d, etc.) As Transformações da Matéria e a Lei da Conservação de Massa Métodos Físicos de Separação (cristalização, destilação, cromatografia).4.Estequiometria: O Conceito de Mol Análise Elementar e Composição Centesimal Fórmulas Empíricas e Moleculares Balanceamento de Equações Químicas Cálculos Estequiométricos Rendimento Teórico e Percentual Cálculos envolvendo estequiometria de soluções com concentração em mol/L.5.Termoquímica: Conceito de Energia, Calor e Temperatura A 1ª Lei da Termodinâmica Calor ou Entalpia de Reação Capacidade Calorífica Lei de Hess Energia de Ligação A 2ª Lei da Termodinâmica e a Entropia Energia Livre de Gibbs Espontaneidade das Reações Químicas e de Processos de Mistura: Contribuições da Entalpia e da Entropia6.Equilíbrio Químico: Conceito Geral Lei da Ação das Massas e Constante de Equilíbrio O Princípio de Le Chatelier Fatores que afetam o Equilíbrio Químico.7.Ácidos e Bases: Conceito de Arrhenius, Bronsted e Lowry, e Lewis Força Relativa de Ácidos e Bases Dissociação da Água e Conceito de pH Dissociação de Eletrólitos Fracos Noções de Titulação Ácido-Base, Indicadores Ácido-Base e o Ponto de Equivalência e Efeito Tampão.8.Eletroquímica: Balanceamento de Reações e Identificação de Agentes Oxidantes e Redutores. Exemplos de Células Eletrolíticas, Pilhas Galvânicas e Pilhas de Concentração Potenciais de Redução Previsão da Espontaneidade de Reações de Oxi-Redução.9.Cinética Química: Significado da Velocidade de Reação e do Mecanismo A Teoria das Colisões Teoria do Estado de Transição Diagramas de Energia Efeito da Temperatura sobre a Velocidade e Energia de Ativação Catalisadores e Inibidores."
    },
    {
        "codigo": "IQD0126",
        "nome": "QUIMICA GERAL EXPERIMENTAL",
        "ementa": "CARACTERIZACAO DA NATUREZA E DO PAPEL DAS INVESTIGACOES EXPERIMEN-TAIS EM QUIMICA. ESTUDO DE MEDIDAS E DE ALGARISMOS SIGNIFICATIVOS. DE-SENVOLVIMENTO DE HABILIDADES DE MANUSEIO DE APARELHOS VOLUMETRICOS, DESISTEMAS DE FILTRACAO, DE SISTEMAS DE DESTILACAO E DE PROCESSO QUIMICOS.DESENVOLVIMENTO DO ESPIRITO DE OBSERVACAO, ANALISE E INTERPRETACAO DEFENOMENOS QUIMICOS. ESTUDO EXPERIMENTAL DE PROCESSOS QUIMICOS ELEMENTA-RES.",
        "conteudo": "1) Noções Básicas sobre Segurança no Trabalho em Laboratório de Química.2) Apresentação de Equipamentos, Materiais e Vidrarias a Serem Utilizados Durante a Execução dos Experimentos Propostos.3) Realização de Experimentos Representativos sobre Temas que Reforcem o Aprendizado de Conceitos Fundamentais de Química, tais como: Reação Química Equilíbrio Químico Cinética Química Conceitos de Ácidos e Bases Oxi-Redução Termoquímica Eletroquímica etc.4) Execução de Experimentos Simples e que Correlacionem o Aspecto Conceitual ao Cotidiano no que se Refere a Análise e/ou Preparação de Materiais, tais como: Polímeros, Pigmentos e Corantes, Metais, Alimentos, Bebidas, Medicamentos, Cosméticos, Detergentes."
    },
    {
        "codigo": "ENM0131",
        "nome": "DESENHO MECANICO ASSISTIDO POR COMPUTADOR 1",
        "ementa": "Objetivos da Disciplina: A disciplina objetiva o desenvolvimento de competências, habilidades e atitudes na leitura, interpretação e execução de desenhos técnicos segundo as normas brasileiras. Ao final do curso, o aluno terá desenvolvimendo suas competências (conhecimentos) e habilidades na utilização da Geometria Descritiva para leitura e execuçaão de desenhos técnicos sendo capaz de utilizar os métodos descritivos da geometria, o sistema de cortes e fazendo uso de visrtas auxiliares. Espera-se também que o mesmo seja capaz de aplicar as normas de desenho técnicos brasileiras para a representação e cotagem de elementos de máquinas comuns à Engenharia Mecânica, bem como para a confecção de desenhos arquitetônicos, elétricos e hidráulicos simples. Objetiva-se também que o aluno desenvolva suas habilidades na execução de desenhos a mão-livre e usando o computador como ferramenta de desenho. Espera-se, ainda, que o aluno desenvolva uma atitude profissional condizente com sua futura atuação como engenheiro na atuação como engenheiro na realização de trabalhos técnicos e no cumprimento de suas responsabilidade.",
        "conteudo": "- Normas de desenho Técnico- Introdução ao CAD- Geometria Descritiva - CAD Básico - Projeção Ortogonal- Desenho a mão-livre- Comandos básicos de construção e edição no CAD- Cotagem e Indicação de tolerâncias- Textos e Blocos - Vistas em Cortes e Vistas Auxiliares- Hachuras no CAD- Desenho Isométrico- Desenho Isométrico no CAD 2D- Sinais de Acabamento e simbologia de soldagem- Impressão no CAD- Roscas, Parafusos e Rebites - Polias, Chavetas, Rolamentos e Engrenagens- Desenho Arquitetônico, Desenho Elétrico e Hidraúlico."
    },
    {
        "codigo": "EST0023",
        "nome": "PROBABILIDADE E ESTATÍSTICA",
        "ementa": "Análise Descritiva, Cálculo de Probabilidades, Variáveis Aleatórias Discretas, Variáveis Aleatórias Contínuas, Variáveis Aleatórias Multidimensionais, Noções de Amostragem e Estimação, Testes de Hipóteses.",
        "conteudo": "UNIDADE I - Análise Descritiva de Dados - População e amostra, Tipos de variáveis. Distribuição de frequências, Gráficos e medidas resumo. UNIDADE II - Cálculo de Probabilidades - Espaço amostral e eventos, Axiomas de probabilidade, Probabilidade condicional, Lei da multiplicação, Teorema da probabilidade total, Teorema de Bayes. UNIDADE III - Variáveis Aleatórias Discretas - Definição e estudo de caso, Função densidade de massa, Função distribuição, Valor esperado e variância, Principais modelos: Uniforme Discreta, Bernoulli, Binomial, Geométrica, Hipergeométrica e Poisson, Aproximação Poisson à binomial. UNIDADE IV - Variáveis Aleatórias Contínuas - Definição e estudo de caso, Função densidade de probabilidade, Função distribuição, Valor esperado e variância, Principais modelos: Uniforme Contínua, Exponencial, Normal e t-Student. Função de uma variável aleatória. UNIDADE V - Variáveis Aleatórias Multidimensionais - Distribuição conjunta (caso discreto), Variáveis aleatórias independentes, Soma de variáveis aleatórias independentes, Funções de variáveis aleatórias, Esperança de uma função de variáveis aleatórias, Covariância e correlação, Distribuição condicional (caso discreto). UNIDADE VI - Noções de Amostragem e Estimação - Introdução à amostragem, Amostra aleatória simples, Distribuição amostral da média e proporção, Teorema Limite Central, Estimação pontual: método dos momentos, Estimação pontual: máxima verossimilhança, Intervalos de confiança para a média e proporção, Intervalos de confiança para a diferença de médias (populações normais, variâncias conhecidas e amostras independentes). UNIDADE VII - Testes de Hipóteses - Teste para a média com variância conhecida, Teste para a média com variância desconhecida, Teste para a proporção, O poder de um teste, O p-valor."
    },
    {
        "codigo": "IFD0175",
        "nome": "FISICA 2",
        "ementa": "Módulos 1: Equilíbrio e elasticidade 2: Gravitação 3: Mecanica dos fluidos 4: Movimento periodico 5: Ondas mecanicas 6: Modos normais e som 7: Fenomenos ondulatórios 8: Temperatura e calor 9: Propriedades termicas da matéria ´ 10: Trabalho e primeira lei da termodinamica 11: Gases ideais e Processos termodinâmicos 12: Segunda lei da termodinâmica.",
        "conteudo": "1-CONTEUDO TEORICO 1-DINAMICA DA ROTACAO 1.1- TORQUE SOBRE UMA PARTICULA 1.2- MOMENTO ANGULAR DE UMA PARTICULA E DE UM SISTEMA DE PARTICULAS. 1.3- ENERGIA CINETICA DE ROTACAO E MOMENTO DE INERCIA. 1.4- DINAMICA DE ROTACAO DE UM CORPO RIGILO. 1.5- MOVIMENTO COMBINADO DE TRANSLACAO E ROTACAO DE UM CORPO RIGIDO. 2- CONSERVACAO DO MOMENTUM ANGULAR 2.1- O PIAO 2.2- MOMENTO ANGULAR E VELOCIDADE ANGULAR. 3- OSCILACOES 3.1- O OSCILADOR HARMONICO SIMPLES E O MOVIMENTO HARMONICO SIMPLES (MHS). 3.2- A ENERGIA NO MHS. 3.3- MHS E MCU 3.4- SUPERPOSICAO DE MHS. 3.5- MOVIMENTO ACOPLADO. 3.6- MOVIMENTO HARMONICO AMORTECIDO. 3.7- OSCILACOES FORCADAS E RESSONANCIA. 4- GRAVITACAO 4.1- HSITORICO 4.2- ALEI DA GRAVITACAO UNIVERSAL E A CONSTANTE G. 4.3- MASSA INERCIAL E GRAVITACIONAL DE UMA DISTRIBUICAO ESFERICA DE MASSA. 4.4- OS MOVIMENTOS DOS PLANETAS E SATELITES. 4.5- EFEITO GRAVITACIONAL DE UMA DISTRIBUICAO ESFERICA DE MASSA. 4.6- O CAMPO GRAVITACIONAL E A ENERGIA POTENCIAL GRAVITACIONAL. 4.7- ENERGIA POTENCIAL PARA UM SISTEMA DE MUITAS PARTICULAS. 4,8- A TERRA COMO REFERENCIAL INERCIAL. 4.9- O PRINCIPIO DE EQUIVALENCIA. 5- ESTATICA DOS FLUIDOS 5.1- FLUIDOS 5.2- PRESSAO E MASSA ESPECIFICA 5.3- VARIACAO DE PRESSAO EM UM FLUIDO EM REPOUSO. 5.4- PRINCIPIO DE PASCAL E ARQUIMEDES. 5.5- MEDIDOR DE PRESSAO. 6- DINAMICA DOS FLUIDOS 6.1- ESCOAMENTO DE FLUIDO 6.2- LINHAS DE CORRENTE 6.3- EQUACAO DE CONTINUIDADE 6.4- EQUACAO DE BERNOULLI 6.5- CONSERVACAO DO MOMENTO NA MECANICA DOS FLUIDOS. 6.6- CAMPOS DE ESCOAMENTO. 7- ONDAS EM MEIOS ELASTICOS 7.1- ONDAS MECANICAS E TIPOS DE ONDAS. 7.2- ONDAS PROGRESSIVAS E ESTACIONARIAS. 7.3- O PRINCIPIO DA SUPERPOSICAO. 7.4- VELOCIDADE DE ONDA. 7.5- POTENCIA E INTENSIDADE DE UMA ONDA. 7.6- INTERFERENCIA DE ONDAS. 7.7- RESSONANCIA. 8- ONDAS SONORAS 8.1- ONDAS AUDIVEIS, ULTRA-SONICAS E INFRA-SONICAS. 8.2- PROGRAMACAO E VELOCIDADE DE ONDAS LONGITUDINAIS. 8.3- ONDAS LONGITUDINAIS ESTACIONARIAS. 8.4- SISTEMAS VIBRANTES E FONTES SONORAS. 8.5- BATIMENTOS. 8.6- EFEITO DOPLER E ONDAS DE CHOQUE. 9- TEMPERATURA 9.1- EQUILIBRIO TERMICO E A LEI ZERO DA TERMODINAMICA. 9.2- MEDIDA DA TEMPERATURA. 9.3- A ESCALA TERMOMETRICA DE UM GAS IDEAL. 9.4- AS ESCALAS CELSIUS E FARENHEIT. 9.5- A ESCALA TERMOMETRICA PRATICA INTERNACIONAL. 9.6- A DILATACAO TERMICA LINEAR SUPERFICIAL VOLUMETRICA 9.7- TENSOES TERMICAS 10- CALOR E A 1a. LEI DA TERMODINAMICA 10.1- CALOR UMA FORMA DE ENERGIA. 10.2- MEDIDA DE CALOR CALOR ESPECIFICO E CAPACIDADE TERMICA 10.3- CAPACIDADE TERMICA MOLAR DOS SOLIDOS. 10.4- FORMAS DE TRANSMMISSAO DE CALOR: CONDUCAO, CONVECCAO E RADIACAO. 10.5- EQUIVALENTE MECANICO DO CALOR. 10.6- CALOR E TRABALHO. 1a. LEI DA TERMODINAMICA. 11- TEORIA CINETICA DOS GASES 11.1- GAS IDEAL: DIFINICOES, MICROSCOPICA E MACROSCOPICA. 11.2- CALCULO CINETICO DA PRESSAO. 11.3- INTERPRETACAO CINETICA DA TEMPERATURA. 11.4- FORCAS INTERMOLECULARES. 11.5- CALOR ESPECIFICO DE UM GAS IDEAL. 11.6- EQUIPARTICAO DE ENERGIA. 11.7- LIVRE PERCURSO MEDIO. 11.8- DISTRIBUICAO DE VELOCIDADES MOLECULARES. A DISTRIBUICAO DE MAXWELL-BOLTZMANN. 11.9- MOVIMENTO BROWNIANO. 11.10- EQUACAO DE ESTADO DE VAN DER WAALS. 12- ENTROPIA E 2a. LEI DA TERMODINAMICA 12.1- TRANSFORMACOES REVERSIVEIS E IRREVERSIVEIS. 12.2- O CICLO DE CARNOT E A 2a. LEI DA TERMODINAMICA. 12.3- O RENDIMENTO DAS MAQUINAS. 12.4- A ESCALA TERMODINAMICA DE TEMPERATURA. 12.5- ENTROPIA: PROCESSOS REVERSIVEIS E IRREVERSIVEIS. 12.6- ENTROPIA E 2a. LEI 12.7- ENTROPIA E DESORDEM"
    },
    {
        "codigo": "IFD0177",
        "nome": "FISICA 2 EXPERIMENTAL",
        "ementa": "GIROSCOPIO. MOVIMENTO PERIODICO. HIDROSTATICA. ONDAS SONORAS. DILATACAO LINEAR. CALOR ESPECIFICO. DOS SOLIDOS. CONDUCAO DE CALOR. COMPORTAMENTO DO GASES.",
        "conteudo": "I-DINAMICA DE ROTACAO. ESTUDO DO GIROSCOPIO. TORQUES. MOMENTOS DE INERCIA. CONSERVACAO DO MOMENTO ANGULAR. II-MOVIMENTO HARMONICO SIMPLES. PENDULO SIMPLES. III-PRINCIPIO DE ARQUIMEDES. CALCULO DO EMPUXO. DENSIDADE. COEFICIENTE DE VISCOSIDADE. IV-VELOCIDADE DE PROPAGACAO DO SOM NO AR. MEDIDAS DO COMPRIMENTO DE ONDA. V-OBTENCAO DO COEFICIENTE DE EXPANSAO LINEAR. CALOR ESPECIFICO DE SOLIDOS. VI-GASES IDEAIS E REAIS. MEDIDAS DE PRESSAO. EQUACOES DE ESTADO."
    },
    {
        "codigo": "MAT0026",
        "nome": "CÁLCULO 2",
        "ementa": "Sequências e séries numéricas séries de potências fórmula de Taylor equações diferenciais ordinárias de 1ª ordem equações diferenciais ordinárias lineares o método da série de potências a transformada de Laplace sistemas lineares de equações diferenciais ordinárias de 1ª ordem.",
        "conteudo": "1. Sequências Séries numéricas2. Séries de potências: Soma, diferença, produto e quociente de séries de potências. Derivação e integração de Séries de Potências. Aplicações3. Fórmula de Taylor, estimativa de resto e aproximações (Funções de uma Variável)4. Equações diferenciais ordinárias de 1a ordem: motivação interpretação geométrica equações com variáveis separadas fatores integrantes equações lineares de 1ª ordem Método da Variação de Parâmetros família de curvas ortogonais a uma dada família de curvas aplicações Teorema de Existência e Unicidade para o problema de valor inicial (sem demonstração)5. Equações diferenciais ordinárias lineares: oscilador harmônico equações de 2ª ordem com coeficientes constantes problema de valor inicial equação característica sistema fundamental de soluções solução geral oscilações livres equações de ordem arbitrária com coeficientes constantes, caso homogêneo e não homogêneo Métodos dos coeficientes a determinar Método de Variação de Parâmetros. Oscilações forçadas outras aplicações6. O método das séries de potências: A equação de Cauchy equações lineares com coeficientes variáveis resolução através de séries de potências equação de Legendre polinômios de Legengre Método de Frobenius equação indicial7. Transformada de Laplace: integrais impróprias, definição, propriedades básicas e exemplos relação com a derivada e integral aplicações à equações diferenciais8. Sistemas lineares de equações diferenciais ordinárias de 1a ordem: motivação sistemas lineares homogêneos com coeficientes constantes plano de fase"
    },
    {
        "codigo": "MAT0031",
        "nome": "INTRODUCAO A ALGEBRA LINEAR",
        "ementa": "Sistemas lineares e matrizes Espaços vetoriais Produto interno Transformações lineares Autovalores e autovetores Diagonalização de operadores Aplicações.",
        "conteudo": "1. Sistemas lineares e matrizes: operações elementares e forma escada inversão de matrizes por operações elementares determinantes e suas propriedades2. Espaços vetoriais: vetores no plano e no espaço espaços euclidianos R^2 e R^3 produto escalar projeções produto vetorial volume de paralelepípedos retas e planos espaços e subespaços vetoriais combinação linear, dependência e independência linear base de um espaço vetorial3. Produto interno: definição de produto interno exemplos norma, ângulo entre vetores processo de ortogonalização de Gram-Schmidt 4. Transformações lineares: transformações lineares do plano no plano aplicações lineares e matrizes mudança de base5. Autovalores e autovetores: definição de autovalores e autovetores polinômio caracteristico6. Diagonalização de operadores: base de autovetores transformações ortogonais7. Aplicações"
    },
    {
        "codigo": "CIC0090",
        "nome": "ESTRUTURAS DE DADOS",
        "ementa": "Gerenciamento dinâmico da memória. Listas. Pilhas. Filas. Árvores. Ordenação e Pesquisa.Pesquisa em Árvores. Grafos. Análise e aplicação de estruturas avançadas em problemas de programação. Resolução de problemas. Aplicações em problemas ambientais.",
        "conteudo": "Gerenciamento dinâmico da memória.Listas. Pilhas. Filas. Árvores. Ordenação e Pesquisa.Pesquisa em Árvores. Grafos. Análise e aplicação de estruturas avançadas em problemas de programação. Resolução de problemas. Aplicações em problemas ambientais."
    },
    {
        "codigo": "ENM0120",
        "nome": "MECANICA 1",
        "ementa": "INTRODUCAOCONCEITOS BASICOSEQUILIBRIO DE CORPOS RIGIDOS EQUILIBRIO DE ESTRUTURAS ESFORCOS INTERNOS PRINCIPIOS DOS TRABALHOS VIRTUAIS E ENERGIA POTENCIAL FUNDAMENTOS DE ESTABILIDADE TRACAO EM BARRAS APLICACOES COMPUTACIONAIS E EXPERIMENTAIS. * objetivos da disciplinas: Desenvolver no aluno a capacidade de analisar e resolver problemas com base no estudo das forças e seus efeitos, aplicado na solução destes problemas alguns conceitos básicos e princípios fundamentais da física e, em particular, da mecânica dos corpos rígidos, dentro do âmbito da estática e tendo em vista a aplicação na engenharia.",
        "conteudo": "1.0 - INTRODUÇÃO 1.1 - Domínio da mecânica 1.2 - A modelagem estática de sistemas mecânicos. 2.0 - CONCEITOS BÁSICOS 2.1 - Centroides e centros de massa 2.2 - Vetores e algebra matrical 2.3 - Forças e momentos 2.4 - Equilíbrio de partículas. 3.0 - EQUILÍBRIO DE CORPOS RÍGIDOS 3.1 - Diagrama de corpo livre 3.2 - EquilÍbrio de forças e momentos 3.3 - Graus de Liberdade e Vinculos. 4.0 - EQUILÍBRIO DE ESTRUTURAS 4.1 - Trelicas 4.2 - Portiços 4.3 - Mecanismos. 5.0 - ESFORÇOS INTERNOS 5.1 - Forças normais e cortantes, momentos fletores e torções 5.2 - Diagramas de esforcos 5.3 - Relações diferentes entre os esforços internos. 6.0 - PRINCÍPIOS DOS TRABALHOS VIRTUAIS E ENERGIA POTENCIAL 6.1 - Trabalho virtual 6.2 - Energia potencial. 7.0 - FUNDAMENTOS DE ESTABILIDADE 7.1 - Aplicações em estruturas 7.2 - Estabilidade de sistema de corpos rígidos e vinculações elásticas. 8.0 - TRAÇÃO EM BARRAS 8.1 - Barras tracionadas: hipotése cinemática 8.2 - Conceito de tensão normal 8.3 - Deformação em barras elásticas. 8.4 - Relação constitutiva elástica linear 8.5 - Problemas de equilíbrio 8.6 - Dimensionamento para resistência."
    },
    {
        "codigo": "IFD0179",
        "nome": "FISICA 3",
        "ementa": "LEI DE COULOMB. O CAMPO ELETRICO - LEI DE GAUSS. POTENCIAL, CAPACITANCIA, PROPRIEDADE DOS DIELETRICOS. CORRENTE, RESISTENCIA E FEM. CIRCUITOS E INSTRUMENTOS DE CORRENTE CONTINUA. O CAMPO MAGNETICO. FORCAS MAGNETICAS SOBRE CONDUTORES DE CORRENTES. CAMPO MAGNETICO PRODUZIDO POR CORRENTES. FORCA ELETROMOTRIZ INDUZIDA. CORRENTES ALTERNADAS. EQUACOES DE MAXWELL.",
        "conteudo": "I-LEI DE COULOMB. CONSERVACAO DA CARGA. CAMPO ELETRICO. DIPOLO ELETRICO. LEI DE GAUSS. FLUXO ELETRICO. II-POTENCIAL DE CARGAS DISCRETAS E DE UM DIPOLO. POTENCIAL DE UMA DISTRIBUICAO CONTINUA DE CARGAS. GRADIENTE DE POTENCIAL. III-CAPACITOR. CALCULO DA CAPACITANCIA. DIELETRICOS. VETORES ELETRICOS. VISAO MICROSCOPICA DOS DIELETRICOS. IV-CORRENTE ELETRICA. RESISTIVIDADE. LEI DE OHM. TRANSFERENCIA DE ENERGIA NUM CIRCUITO ELETRICO. FEM. CIRCUITOS DE MALHA UNICA. LEI DAS MALHAS. CIRCUITOS RC. AMOERIMETRO, VOLTIMETRO, OHMIMETRO, POTENCIOMETRO. V-CONCEITO DE CAMPO MAGNETICO. FORCA MAGNETICA. TORQUE SOBRE UMA ESPIRA. EFEITO HALL. TRAJETORIA DE UMA CARGA NUM CAMPO MAGNETICO. VI-LEI DE AMPERE. LINHAS DE CAMPO MAGNETICO. LEI DE BIOT-SOVART. SOLENOIDE. LEI DE FARRADAY E DE LENZ. CAMPOS MAGNETICOS DEPENDENTES DO TEMPO. VII-INDUTOR. CALCULO DA INDUTANCIA. CIRCUITO LR. DENSIDADE DE ENERGIA. OSCILACOES DOS CIRCUITOS LC. VIII-CORRENTE ALTERNADA. CIRCUITOS LRC. POTENCIA EM CIRCUITOS ALTERNADOS. RESSONANCIA. FILTROS E RETIFICADORES. TRANSFORMADORES. IX-CAMPOS MAGNETICOS INDUZIDOS. CORRENTE DE DESLOCAMENTO. AS EQUACOES DE MAXWELL."
    },
    {
        "codigo": "IFD0181",
        "nome": "FISICA 3 EXPERIMENTAL ",
        "ementa": "FUNDAMENTOS TEÓRICOS USO DE MEDIDORES ELÉTRICOS E FONTES RESISTÊNCIA ELÉTRICA OHMICA E NÃO OHMICA FONTE DE TENSÃO FEM E RESISTÊNCIA INTERNA PONTE DE WHEATSTONE MEDIDAS DE RESISTÊNCIAS, SUPERFÍCIES EQUIPOTENCIAIS E LINHAS DE CAMPO DEFLEXÃO ELETROMAGNÉTICA DE ELÉTRONS CAPACITORES SOB CORRENTES CC FORÇA MAGNÉTICA SOBRE SEGMENTOS RETILÍNEOS DE CORRENTES AS BOBUNAS DE HELMHOLTZ E A RAZÃO e/m PARA O ELÉTRON CIRCUITOS COM CORRENTES ALTERNADAS RESSONÂNCIA NO CIRCUITO RLC SÉRIE TRANSFORMADORES E CIRCUITOS RETIFICADORES.",
        "conteudo": "EXPERIENCIA 1 - USO DE MEDIDORES ELÉTRICOS E FONTES DE TENSÃO 1.1- FONTES DE ALIMENTACÃO 1.2- MULTIMETROS: VOLTÍMETRO, AMPERÍMETRO E OHMÍMETRO 1.3- MONTAGEM DE CIRCUITOS DE UMA MALHA EXPERIENCIA 2 - RESISTÊNCIA ELÉTRICA 2.1- RESISTORES OHMICOS 2.2- RESISTORES NÃO OHMICOS (DIODO) 2.3- CURVA CARACTERÍSTICA DE UM RESISTOR 2.4- RETA DE CARGA EXPERIENCIA 3 - FONTE DE TENSÃO 3.1- CURVA DE REGULAÇÃO DE UMA FONTE 3.2- FORÇA ELETROMOTRIZ3.3- RESISTENCIA INTERNA EXPERIENCIA 4 - PONTE DE WHEATSTONE 4.1- MONTAGEM DE CIRCUITO COM DIVERSAS MALHA 4.2- MEDIDAS DE RESISTÊNCIA USANDO A PONTE 4.3- LEVANTAR A CONFIGURAÇÃO DE SUPERFÍCIES E EQUIPOTENCIAIS DE UM CAMPO ELÉTRICO 4.4- COMPORTAMENTO DE LINHAS DE CAMPO ELÉTRICO PRÓXIMO A CONDUTORES E ISOLANTES EXPERIENCIA 5 - DEFLEXÕES ELETROMAGNÉTICA DE ELÉTRONS 5.1- TUBO DE RAIOS CATÓDICOS 5.2- UTILIZAÇÃO DE FONTE DE ALTA TENSÃO (HEATHKIT5.3- DEFLEXÃO EM UM CAMPO ELÉTRICO5.4- DEFLEXÃO EM UM CAMPO MAGNÉTICO EXPERIENCIA 6 - CAPACITORES ALIMENTATADOS COM CORRENTE CONTÍNUA6.1- OSCILOSCÓPIO 6.2- CIRCUITO RC SÉRIE - CC 6.3- USO DO OSCILOSCÓPIO NA OBSERVAÇÃO DA CARGA E DESCARGA DE UM CAPACITOR6.4- MEDIDA DA CONSTANTE DE TEMPO CAPACITIVA EXPERIENCIA 7 - FORÇA MAGNÉTICA EM SEGMENTOS RETILÍNEOS DE CORRENTE 7.1- NOVOS INSTRUMENTOS: ELETROMAGNETICO, BALANÇA COM VERNIER, TESLÍMETRO COM SONDA HALL E FONTES DE TENSÃO 7.2- FORÇA DEVIDA A UM CAMPO MAGNÉTICO VERSUS COMPRIMENTO DO SEGMENTO DE CORRENTE 7.3- FORÇA VERSUS DIREÇÃO DO CAMPO MAGNÉTICO7.4- FORÇA VERSUS A INTENSIDADE DA CORRENTE DO SEGMENTO7.5- MEDIDAS DE CAMPO MAGNÉTICO USANDO O TESLÍMETRO EXPERIENCIA 8 - AS BOBINAS DE HELMHOLTZ E A RAZÃO e/m PARA O ELÉTRON 8.1- CAMPO MAGNÉTICO NO EIXO DE UMA ESPIRA8.2- CAMPO MAGNÉTICO NA REGIÃO CENTRAL DAS BOBINAS DE HELMHOLTZ8.3- ORBITAS DE ELÉTRONS NUM CAMPO MAGNÉTICO UNIFORME8.4- DETERMINAÇÃO DA RAZÃO e/m PARA O ELÉTRON EXPERIENCIA 9 - CIRCUITOS ALIMENTADOS COM CORRENTE ALTERNADA (CA)9.1- INDUTOR E INDUTÂNCIA, L 9.2- MEDIDAS DE TENSÃO E CORRENTE, VALORES EFICAZES, - CA 9.3- CIRCUITOS RL, RC, RLC, EM SÉRIE - CA 9.4- FREQUÊNCIA, IMPEDÂNCIA, REATÂNCIA E FATOR DE POTÊNCIA - CA9.5- DIAGRAMAS ROTORIAISEXPERIÊNCIA 10 - RESSONÂNCIA, O OSCILADOR ELETROMAGNÉTICO FORÇADO10.1- COMPORTAMENTO DA AMPLITUDE DE CORRENTE COM FREQUÊNCIA10.2- FREQUÊNCIA DE RESSONÂNCIA10.3- ÂNGULO DE FASE VERSUS FREQUÊNCIA10.4- INDUÇÃO NUM CIRCUITO ISOLADO - LEI DE FARADAY EXPERIÊNCIA 11 - TRANSFORMADORES E CIRCUITOS RETIFICADORES11.1- O TRANSFORMADOR11.2- RETIFICADOR DE MEIA ONDA SEM E COM FILTRO CAPACITIVO11.3- RETIFICADOR DEONDA COMPLETA SEM E COM FILTRO CAPACITIVO11.4- RETIFICADOR DE ONDA COMPLETA COM PONTE DE DIODO, COM E SEM FILTRO CAPACITIVO11.5- RETIFICADOR DE ONDA COMPLETA COM PONTE DE DIODO, FILTRO CAPACITIVO E REGULADOR DE TENSÃO."
    },
    {
        "codigo": "MAT0027",
        "nome": "CÁLCULO 3",
        "ementa": "Vetores no plano e no espaço funções de várias variáveis fórmula de Taylor e aplicações transformações diferenciáveis o teorema da função inversa e da função Implícita.",
        "conteudo": "1. Vetores no plano e no espaço: conceito e propriedades. Produto escalar, Vetorial e misto, projeções. Vetor tangente e normal unitários. Vetores velocidade e aceleração. Aplicações. Campos vetoriais no plano e no espaço2. Funções de várias variáveis (com ênfase em funções de duas e três variáveis): gráficos, curvas de nível e superfícies de nível. Limites e continuidade: conceito, propriedades e interpretação geométrica e como taxa de variação. Derivadas parciais: conceito, propriedades, interpretação geométrica e como taxa de variação, derivadas parciais de ordem superior, igualdade entre derivadas mistas. Diferenciabilidade e a diferencial total: conceito, propriedades, interpretação geométrica. Plano tangente. Regra da Cadeia e derivação implícita. Derivadas direcionais e vetor gradiente: conceito, propriedades, interpretação geométrica e como taxa de variação3. Fórmula de Taylor, pontos de extremos locais e absolutos. Pontos críticos. Multiplicadores de Lagrange. Aplicações em problemas de otimização4. Transformações diferenciáveis: a derivada como transformação linerar, Matrizes e Determinantes Jacobianos, A regra da cadeia geral, Teorema da Função Inversa, Teorema da função Implícita, derivação implícita5. Integrais múltiplas: Integrais duplas: conceito, propriedades, integração por iteração, cálculo de áreas, volumes e outras aplicações, integrais duplas em coordenadas polares, transformações no plano, o Jacobiano de uma transformação, mudanças de coordenadas em integrais duplas. Integrais triplas: conceito, propriedades, integração por iteração, cálculo de volumes e outras aplicações, Integrais triplas em coordenadas cilíndricas e esféricas, transformações no espaço, o Jacobiano de uma transformação, mudanças de coordenadas em integrais triplas6. Integrais de linha: curvas parametrizadas no plano e no espaço, parametrização de gráficos de funções, segmentos de retas, arcos de circunferências, arcos de elipses e outras curvas básicas. Integrais de linha de campos vetoriais: conceito, propriedades. Cálculo de integrais de linha por parametrização. Campos gradientes, função potencial e integrais de linha. Teorema de Green. Aplicações: cálculo do trabalho de um campo de forças e outras aplicações7. Integrais de superfícies, Teorema da Divergência e Teorema de Stokes: parametrização de gráficos de funções, superfícies de revolução, superfícies esféricas, superfícies planas e outras superfícies básicas. Vetores normais a uma superfície e superfície suave. Integrais de superfície: conceito e propriedades, cálculo de integrais de superfícies parametrizadas, cálculo de áreas de superfície e outras aplicações. Teorema da Divergência e de Stokes: fluxo de um campo vetorial através de uma superfície, superfícies orientáveis e superfícies com bordo, Teorema da Divergência e a Lei de Gauss para campos de quadrado inverso, Teorema de Stokes e aplicações."
    },
    {
        "codigo": "CIC0229",
        "nome": "CIRCUITOS LÓGICOS",
        "ementa": "Álgebra Booleana. Estruturas de Portas Lógicas. Circuitos Combinacionais. Memórias. Circuitos Sequenciais. Conversão A/D e D/A.",
        "conteudo": "1. Introdução 1.1. Grandezas digitais e analógicas 1.2. Sistemas de numeração1.3. Códigos Binário, BCD, Gray1.4. Representação numérica2. Álgebra Booleana2.1. Teoremas de DeMorgan2.2. Manipulação de expressões algébricas2.3. Métodos de minimização 2.3.1. Mapa de Karnaugh 2.3.2. Algoritmo de Quine-Mcluskey 3. Estruturas de Elementos Digitais3.1. Tecnologias TTL e CMOS 3.2. Portas lógicas3.3. Buffer Tri-State4. Circuitos Combinacionais 4.1. Multiplexadores / Demultiplexadores4.2. Codificadores / Decodificadores4.3. Circuitos aritméticos4.4. Projeto de circuitos combinacionais5. Elementos de Estado5.1. Latches5.2. Flip-Flops5.3. Registradores5.4. Memórias ROM, SRAM e DRAM6. Circuitos Sequenciais6.1. Contadores síncronos e assíncronos6.2. Máquinas de Estados Finitos - Moore e Mealy6.3. Projeto de circuitos sequenciais 7. Conversores de Sinais7.1. Amplificador Operacional7.1. Conversores Digital/Analógico7.2. Conversores Analógico/Digital"
    },
    {
        "codigo": "CIC0231",
        "nome": "LABORATÓRIO DE CIRCUITOS LÓGICOS",
        "ementa": "Linguagem de Descrição de Hardware. Portas Lógicas. Circuitos Combinacionais. Elementos de Estado. Circuitos Sequenciais. Conversão A/D e D/A. Projeto aplicativo.",
        "conteudo": "1. Introdução 1.1. Instrumental básico 1.2. Prototipação em protoboard1.3. Linguagens de Descrição de Hardware (HDL)1.4. Prototipação em FPGA2. Álgebra Booleana2.1. Teoremas de DeMorgan2.2. Manipulação de expressões algébricas2.3. Métodos de minimização 2.3.1. Mapa de Karnaugh 2.3.2. Algoritmo de Quine-Mcluskey 3. Estruturas de Elementos Digitais3.1. Tecnologias TTL e CMOS 3.2. Portas lógicas3.3. Buffer Tri-State4. Circuitos Combinacionais 4.1. Multiplexadores / Demultiplexadores4.2. Codificadores / Decodificadores4.3. Circuitos aritméticos4.4. Projeto de circuitos combinacionais5. Elementos de Estado5.1. Latches5.2. Flip-Flops5.3. Registradores5.4. Memórias ROM, SRAM e DRAM6. Circuitos Sequenciais6.1. Contadores síncronos e assíncronos6.2. Máquinas de Estados Finitos - Moore e Mealy6.3. Projeto de circuitos sequenciais 7. Conversores de Sinais7.1. Amplificador operacional7.1. Conversores Digital/Analógico7.2. Conversores Analógico/Digital8. Projeto Aplicativo"
    },
    {
        "codigo": "ENM0121",
        "nome": "MECANICA 2",
        "ementa": "INTRODUÇÃO CONCEITOS BÁSICOS MÉTODOS DE ENERGIA CINEMÁTICA DE CORPOS RÍGIDOSDINÂMICA DOS SISTEMAS DE PARTÍCULASDINÂMICA DECORPOS RÍGIDOS APLICAÇÕES EXPERIMENTAIS E COMPUTACIONAIS.",
        "conteudo": "1.0 - INTRODUÇÃO 1.1 - Modelagem dinâmica de sistemas mecânicos 1.2 - Domínio da mecânica. 2.0 - CONCEITOS BÁSICOS 2.1 - Movimento de um ponto. 2.1.1 - Tipos de movimentos. 2.2 - Força, massa e aceleração. 2.2.1 - Equações de movimento para o centro de massa 2.2.2 - Movimento de Inércia. 3.0 - MÉTODOS DE ENERGIA 3.1 - Trabalho e energia cinética 3.2 - Energia potencial 3.3 - Impulsão, momento linear e momento angular. 4.0 - CINEMÁTICA DE CORPOS RÍGIDOS 4.1 - Corpos rigidos e tipos de movimento 4.2 - Cinemática de corpos rigidos no espaço 4.2.1 - Velocidade 4.2.2 - Aceleração 4.2.3 - Movimento de sistemas de referência. 4.3 - Particularização: cinemática de corpos rígidos no plano 4.4 - Noções gerais mecanismos 4.5 - Contatos deslizantes 4.6 - Mecanismos planos articulados 4.7 - Rotação sem deslizamento. 5.0 - DIMÂMICA DOS SISTEMAS DE PARTÍCULAS 5.1 - Equações de movimento para um sistema de partículas 5.2 - trabalho e energia 5.3 - Impulsão, momento linear e momento angular. 6.0 - DINÂMICA DE CORPOS RÍGIDOS 6.1 - Dinâmica de corpos rígidos no espaço 6.1.1 - Balanço de momento linear 6.1.2 - Balanço de momento angular 6.1.3 - Energia cinética 6.1.4 - Equações de Euler 6.1.5 - Movimento giroscópico. 6.2 - Praticularizacao: dinâmica de corpos rígidos no plano 6.3 - Modelagem e simulação de mecanismos planos articulados."
    },
    {
        "codigo": "ENM0164",
        "nome": "MECANICA DOS MATERIAIS 1",
        "ementa": "INTRODUCAO A ELASTICIDADE: DEFORMACOES, FORCAS DE CAMPO E DE CONTATO, TENSOR TENSAO DE CAUCHY, TENSOES PRINCIPAISTORCAO DE BAR- RAS DE SECAO CIRCULAR FLEXAO DE VIGAS CRITERIOS DE RESISTENCIA PARA ESTADOS GERAIS DE TENSOES APLICACOES EXPERIMENTAIS E COMPUTACIONAIS.",
        "conteudo": "1.0 - INTRODUCAO A ELASTICIDADE LINEAR 1.1 - Deformacao de um corpo 1.2 - Medida local de deformacao deformacoes principais 1.3 - Forcas externas de campo e de contato 1.4 - Forcas internas: tensor tensao de Cauchy hipotese de Cau- chy 1.5 - Teorema de Cauchy: existencia e simetria do tensor tensao de Cauchy equacao de equilibrio 1.6 - Tensoes principais 1.7 - Relacao constitutiva para o materail calstico linear. 2.0 - TORCAO DE BARRAS DE SECAO CIRCULAR 2.1 - Hipotese cinematica de Bernoulli 2.2 - Distribuicao de tensoes cisalhantes na secao transversal 2.3 - Deformacao de barras sob esforcos de torcao 2.4 - Problemas de equilibrio(isostaticos/hiperestaticos) 2.5 - Dimensionamento. 3.0 - FLEXAO DE VIGAS 3.1 - Hipotese de Bernoulli para flexao de vigas 3.2 - Distribuicao de tensoes normais na secao transversal 3.3 - Distribuicao de tensoes cisalhantes na secao transversal 3.4 - Deflexao de vigas 3.5 - Problemas de equilibrio (isostaticos/hiperestaticos) 3.6 - Dimensionamento. 4.0 - CRITERIOS DE RESISTENCIA PARA ESTADOS GERAIS DE TENSAO 4.1 - Criterio de Tresca 4.2 - Cri8terio de Von Mises 4.3 - Criterio de Coulomb."
    },
    {
        "codigo": "MAT0028",
        "nome": "VARIAVEL COMPLEXA 1",
        "ementa": "Números complexos Funções de uma variável complexa A derivada A integral e aplicações Séries de potências Funções conformes",
        "conteudo": "1. Números complexos: representação geométrica valor absoluto complexo conjugado forma polar argumento a álgebra dos números complexos raízes n-ésimas2. Funções de uma variável complexa: funções complexas o conceito de limite teoremas sobre limites continuidade derivada fórmulas de derivação equações de Cauchy-Riemann funções analíticas e funções reais harmônicas as funções exponencial, trigonométricas, hiperbólicas, logarítmicas, potências com expoentes complexos inversa de funções trigonométricas as transformações bilineares propriedades de mapeamento das funções exponenciais e logarítimo 3. Integrais: contornos integrais de linha o Teorema de Cauchy Fórmula integral de Cauchy derivadas de ordem superior Teoremas de Morera, do Módulo Máximo, de Liouville, Fundamental da Álgebra4. Séries de potências: séries de Taylor e Lauren integração e derivação de séries multiplicação e divisão de séries pólos Teorema dos resíduos e aplicações5. Funções conformes: exemplos rotação de tangentes funções harmônicas conjugadas inversas aplicações"
    },
    {
        "codigo": "ENE0042",
        "nome": "CIRCUITOS ELÉTRICOS 1",
        "ementa": "Conceitos básicos. Circuitos resistivos. Técnicas de análise nodal e de malhas. Técnicas adicionais de análise. Capacitância e indutância. Análise de circuitos de primeira e segunda ordens. Análise de circuitos em regime permanente senoidal. Análise de potência em regime permanente senoidal.",
        "conteudo": "1 CONCEITOS BÁSICOS 1.1 Sistemas de Unidades 1.2 Grandezas básicas 1.3 Componentes de um circuito 2 CIRCUITOS RESISTIVOS 2.1 Lei de Ohm 2.2 Leis de Kirchhoff 2.3 Circuitos com uma única malha 2.4 Circuitos com um único par de nós 2.5 Circuitos com combinações de resistores em série e em paralelo 2.6 Transformações Y-Delta 2.7 Circuitos com fontes dependentes 3 TÉCNICAS DE ANÁLISE NODAL E DE MALHAS 3.1 Análise nodal 3.2 Análise de malhas 4 TÉCNICAS ADICIONAIS DE ANÁLISE 4.1 Superposição 4.2 Teoremas de Thévenin e de Norton 4.3 Transferência máxima de potência 5 CAPACITÂNCIA E INDUTÂNCIA 5.1 Capacitores 5.2 Indutores 5.3 Combinações de capacitores e de indutores 6 ANÁLISE DE CIRCUITOS DE PRIMEIRA E SEGUNDA ORDENS 6.1 Circuitos de primeira ordem 6.2 Circuitos de segunda ordem 7 ANÁLISE DE CIRCUITOS EM REGIME PERMANENTE SENOIDAL 7.1 Senoides 7.2 Funções forçantes senoidais e complexas 7.3 Fasores 7.4 Relações fasoriais para elementos de circuito 7.5 Impedância e admitância 7.6 Diagramas de fasores 7.7 Análise nodal e de malhas de circuitos em regime permanente senoidal 8 ANÁLISE DE POTÊNCIA EM REGIME PERMANENTE SENOIDAL 8.1 Potência instantânea 8.2 Potência média 8.3 Valores eficazes ou RMS 8.4 Fator de potência 8.5 Potência complexa 8.6 Correção do fator de potência"
    },
    {
        "codigo": "ENE0044",
        "nome": "LABORATÓRIO DE CIRCUITOS ELÉTRICOS 1",
        "ementa": "Experimentos de laboratório refernete aos seguintes tópicos: Conceitos básicos. Circuitos resistivos. Técnicas de análise nodal e de malhas. Técnicas adicionais de análise. Capacitância e indutância. Análise de circuitos de primeira e segunda ordens. Análise de circuitos em regime permanente senoidal. Análise de potência em regime permanente senoidal.",
        "conteudo": "Experimentos de laboratório refernete aos seguintes tópicos: Conceitos básicos. Circuitos resistivos. Técnicas de análise nodal e de malhas. Técnicas adicionais de análise. Capacitância e indutância. Análise de circuitos de primeira e segunda ordens. Análise de circuitos em regime permanente senoidal. Análise de potência em regime permanente senoidal."
    },
    {
        "codigo": "MAT0059",
        "nome": "METODOS MATEMÁTICOS DA FÍSICA 1",
        "ementa": "ALGUMAS EQUACOES DA FISICA MATEMATICA. SERIES DE FOURIER. APLICACOES DE SERIES DE FOURIER AOS PROBLEMAS DE CONTORNO. TRANSFORMADA DE FOURIER E APLICACOES. SERIES DE FUNCOES ORTOGONAIS. OS POLINOMIOS DE LEGENDRE.",
        "conteudo": "1. EQUACAO DA ONDA, EQUACAO DO CALOR E EQUACAO DE LAPLACE: DEDUCAO DESSAS EQUACOES O APARECIMENTO DAS SERIES DE FOURIER. 2. FUNCOES PERIODICAS SERIES DE FOURIER SERIES DE FOURIER DE FUNCOES PARES E IMPARES DIFERENCIACAO E INTEGRACAO DAS SERIES DE FOURIER CONVERGENCIA PONTUAL E UNIFORME DAS SERIES DE FOURIER FORMA COMPLEXA DA SERIE DE FOURIER. 3. RESOLUCAO DAS EQUACOES DO CALOR, ONDA E LAPLACE POR SERIES DE FOURIER, METODO DE SEPARACAO DE VARIAVEIS: RESOLUCAO DA EQUACAO DE CONDUCAO DE CALOR NUMA BARRA RESOLUCAO DA EQUACAO DA CORDA VIBRANTE RESOLUCAO DA EQUACAO DE LAPLACE NO DISCO UNICIDADE DE SOLUCOES. 4. TRANFORMADA DE FOURIER: PROPRIEDADES DA TRANSFORMADA DE FOURIER O TEOREMA DA CONVOLUCAO APLICACOES AOS PROBLEMAS DE VALORES INICIAIS PARA A EQUACAO DO CALOR E DA ONDA.5. ESPACO VETORIAL DE FUNCOES, PRODUTO INTERNO, ORTOGONALIDADE ORTOGONALIDADE DAS FUNCOES SECCIONALMENTE CONTINUAS CONVERGENCIAS EM L2 (NA MEDIA) CONJUNTOS COMPLETOS POLINOMIOS DE LEGENDRE PROPRIEDADES DOS POLINOMIOS DE LEGENDRE APLICACOES A PROBLEMAS DE CONTORNO."
    }
]