{
    "0": "ALGORITMOS E PROGRAMAÇÃO DE COMPUTADORES Princípios fundamentais de construção de programas. Construção de algoritmos e sua representação em pseudocódigo e linguagens de alto nível. Noções de abstração. Especificação de variáveis e funções. Testes e depuração. Padrões de soluções em programação. Noções de programação estruturada. Identificadores e tipos. Operadores e expressões. Estruturas de controle: condicional e repetição. Entrada e saída de dados. Estruturas de dados estáticas: agregados homogêneos e heterogêneos. Iteração e recursão. Noções de análise de custo e complexidade. Desenvolvimento sistemático e implementação de programas. Estruturação, depuração, testes e documentação de programas. Resolução de problemas. Aplicações em casos reais e questões ambientais. ",
    "1": "FISICA 1 Módulos 1: Unidades e grandezas físicas 2: Vetores 3: Movimento retilineo 4: Movimento em duas e três dimensoes 5: Leis de Newton do movimento 6: Aplicação das Leis de Newton 7: Trabalho e Energia Cinetica 8: Energia potencial e conservação de energia 9: Momento linear e impulso 10: Colisões 11: Rotação de corpos rígidos 12:Dinamica do movimento de rotação. I-MEDICAO: GRANDEZAS, PADROES E UNIDADES FISICAS. O SISTEMA INTERNACIONAL DE UNIDADES. PADRAO DE COMPRIMENTO, MASSA E TEMPO. II-VETORES: CARACTERIZACAO DE GRANDEZA VETORIAL. VETORES UNITARIOS. OPERACOES COM VETORES. III-CINEMATICA DA PARTICULA: CONSIDERACOES ENVOLVIDAS NA CINEMATICA DA PARTICULA. CONCEITO DE DIFERENCIACAO E SUA APLICACAO A PROBLEMAS DE MECANICA. EQUACOES DE MOVIMENTO. REPRESENTACAO VETORIAL. MOVIMENTO CIRCULAR UNIFORME. VELOCIDADE E ACELERACAO RELATIVAS. IV-DINAMICA DA PARTICULA: A PRIMEIRA LEI DE NEWTON. OS CONCEITOS DE FORCA E MASSA. A SEGUNDA LEI DE NEWTON. A TERCEIRA LEI DE NEWTON. SISTEMAS DE UNIDADES. FORCAS DE ATRITO. DINAMICA DO MOVIMENTO CIRCULAR UNIFORME. CLASSIFICACAO DAS FORCAS. MECANICA CLASSICA, RELATIVISTICA E QUANTICA. V-TRABALHO E ENERGIA. CONSERVACAO DA ENERGIA. TRABALHO REALIZADO POR UMA FORCA CONSTANTE. CONCEITO DE INTEGRACAO E SUA APLICACAO A PROBLEMAS EM MECANICA. TRABALHO REALIZADO POR FORCA VARIAVEL. ENERGIA CINETICA. TEOREMA TRABALHO-ENERGIA-POTENCIA. FORCAS CONSERVATIVAS E NAO CONSERVATIVAS. ENERGIA POTENCIAL. CONSERVACAO DE ENERGIA. MASSA E ENERGIA. VI-CONSERVACAO DO MOMENTO LINEAR: CENTRO DE MASSA E SEU MOVIMENTO. MOVIMENTO LINERAR. CONSERVACAO DO MOMENTO LINEAR. SISTEMAS DE MASSA VARIAVEL. VII-COLISOES: CONCEITO DE COLISAO. IMPULSO E MOMENTO LINEAR. CONSERVACAO DO MOMENTO LINEAR DURANTE AS COLISOES. SECAO EFICAZ DE CHOQUE. VIII-CINEMATICA DE ROTACAO : AS VARIAVEIS DA CINEMATICA DA ROTACAO. ROTACAO COM ACELERACAO ANGULAR CONSTANTE. GRANDEZAS VETORIAIS NA ROTACAO. RELACAO ENTRE CINEMATICA LINEAR E ANGULAR DE UMA PARTICULA EM MOVIMENTO CIRCULAR . IX-EQUILIBRIO DE CORPOS RIGIDOS: CONCEITO DE CORPO RIGIDO. EQUILIBRIO. CENTRO DE GRAVIDADE. EQUILIBRIO DE CORPOS RIGIDOS NA PRESENCA DO CAMPO GRAVITACIONAL.",
    "2": "FISICA 1 EXPERIMENTAL MEDIDAS E ERROS. ANALISE GRAFICA. ATRITO. COLISAO. CONSERVACAO DO MOMENTO LINEAR. ESTUDO DOS MOVIMENTOS. ROTACAO. CONSERVACAO DE ENERGIA. EQUILIBRIO DE CORPOS RIGIDOS. I-CLASSIFICACAO DOS ERROS. CALCULO DE ERRO EXPERIMENTAL, ALGARISMOS SIGNIFICATIVOS. PROPAGACAO DE ERROS. MEDIDAS COM INSTRUMENTOS DE PRECISAO. II-CONSTRUCAO E ANALISE DE GRAFICOS. GRAFICOS LINEARES, MONO-LOG E LOG-LOG. III-MOVIMENTO NO PLANO INCLINADO. COEFICIENTE DE ATRITO. COEFICIENTE DERESTITUICAO PARA COLISOES. TIPOS DE COLISOES. IV-CONSERVACAO DO MOMENTO LINEAR EM COLISOES, UNIDIMENSIONAIS E BI-DIMENSIONAIS. CONSERVACAO DA ENERGIA. V-ESTUDO DO EQUILIBRIO DE CORPOS RIGIDOS. DIAGRAMAS DE FORCAS.",
    "3": "CÁLCULO 1 Funções de uma variável real, limite e continuidade, derivada, integral, aplicações da integral. 1. Funções: conceito de função exemplo de funções de uma variável real tipos de funções gráficos função composta função inversa funções trigonométricas e suas inversas função exponencial função logaritmo2. Limite e continuidade: conceito de limite propriedades dos limites limites laterais limites envolvendo o infinito continuidade Teorema do Valor Intermediário3. Derivadas: conceito de derivada reta tangente e reta normal derivadas laterais regras básicas de derivação regra da cadeia taxas relacionadas derivada da função inversa derivação implícita comportamento de funções máximos e mínimos Teorema do Valor Médio regras de l'Hospital concavidade, inflexão e gráficos problemas de otimização4. Integrais: primitivas integrais indefinidas e suas propriedades integral definida e suas propriedades Teorema Fundamental do Cálculo integração por substituição integração por partes integração por frações parciais integração de produtos de funções trigonométricas integração por substituição inversa integração por substituições especiais.5. Aplicações da integral: aplicações da integral ao cálculo de áreas planas, comprimento de curvas, volumes e áreas de sólidos.",
    "4": "INTRODUCAO A ENGENHARIA MECATRONICA A Universidade de Brasília. Engenharia, Controle e Automação, e as Diretrizes Curriculares Nacionais. Estrutura curricular do curso. Atividades Extracurriculares. Palestras motivadoras. ",
    "5": "QUIMICA GERAL TEORICA Abordagem conceitual dos princípios fundamentais da Química e suas aplicações, usando exemplo de compostos orgânicos e inorgânicos. Ênfase à interface da Química com as diversas áreas do conhecimento. Introdução ao trabalho em laboratório de química. Observação e interpretação de fenômenos químicos através da realização de experimentos representativos que correlacionem o aspecto conceitual à vida cotidiana de uma maneira estimulante. 1.Estrutura Atômica e a Lei Periódica: O Modelo da Radiação Eletromagnética e o Espectro Atômico Evolução Histórica do Modelo Atômico O Modelo de Bohr do Átomo de Hidrogênio A Mecânica Quântica Configuração Eletrônica dos Elementos e a Tabela Periódica.2.Ligação Química e Estrutura Molecular: Estruturas de Lewis O Modelo VSEPR A Ligação Covalente e suas Propriedades (comprimento, energia e polaridade) Estruturas Moleculares (Teoria da Ligação de Valência, Teoria dos Orbitais Híbridos e Teoria dos Orbitais Moleculares).3.Matéria: Classificação da Matéria Estados Físicos da Matéria (Forças Intermoleculares e Propriedades Físicas: PE, PF, d, etc.) As Transformações da Matéria e a Lei da Conservação de Massa Métodos Físicos de Separação (cristalização, destilação, cromatografia).4.Estequiometria: O Conceito de Mol Análise Elementar e Composição Centesimal Fórmulas Empíricas e Moleculares Balanceamento de Equações Químicas Cálculos Estequiométricos Rendimento Teórico e Percentual Cálculos envolvendo estequiometria de soluções com concentração em mol/L.5.Termoquímica: Conceito de Energia, Calor e Temperatura A 1ª Lei da Termodinâmica Calor ou Entalpia de Reação Capacidade Calorífica Lei de Hess Energia de Ligação A 2ª Lei da Termodinâmica e a Entropia Energia Livre de Gibbs Espontaneidade das Reações Químicas e de Processos de Mistura: Contribuições da Entalpia e da Entropia6.Equilíbrio Químico: Conceito Geral Lei da Ação das Massas e Constante de Equilíbrio O Princípio de Le Chatelier Fatores que afetam o Equilíbrio Químico.7.Ácidos e Bases: Conceito de Arrhenius, Bronsted e Lowry, e Lewis Força Relativa de Ácidos e Bases Dissociação da Água e Conceito de pH Dissociação de Eletrólitos Fracos Noções de Titulação Ácido-Base, Indicadores Ácido-Base e o Ponto de Equivalência e Efeito Tampão.8.Eletroquímica: Balanceamento de Reações e Identificação de Agentes Oxidantes e Redutores. Exemplos de Células Eletrolíticas, Pilhas Galvânicas e Pilhas de Concentração Potenciais de Redução Previsão da Espontaneidade de Reações de Oxi-Redução.9.Cinética Química: Significado da Velocidade de Reação e do Mecanismo A Teoria das Colisões Teoria do Estado de Transição Diagramas de Energia Efeito da Temperatura sobre a Velocidade e Energia de Ativação Catalisadores e Inibidores.",
    "6": "QUIMICA GERAL EXPERIMENTAL CARACTERIZACAO DA NATUREZA E DO PAPEL DAS INVESTIGACOES EXPERIMENTAIS EM QUIMICA. ESTUDO DE MEDIDAS E DE ALGARISMOS SIGNIFICATIVOS. DE-SENVOLVIMENTO DE HABILIDADES DE MANUSEIO DE APARELHOS VOLUMETRICOS, DESISTEMAS DE FILTRACAO, DE SISTEMAS DE DESTILACAO E DE PROCESSO QUIMICOS.DESENVOLVIMENTO DO ESPIRITO DE OBSERVACAO, ANALISE E INTERPRETACAO DEFENOMENOS QUIMICOS. ESTUDO EXPERIMENTAL DE PROCESSOS QUIMICOS ELEMENTARES. 1) Noções Básicas sobre Segurança no Trabalho em Laboratório de Química.2) Apresentação de Equipamentos, Materiais e Vidrarias a Serem Utilizados Durante a Execução dos Experimentos Propostos.3) Realização de Experimentos Representativos sobre Temas que Reforcem o Aprendizado de Conceitos Fundamentais de Química, tais como: Reação Química Equilíbrio Químico Cinética Química Conceitos de Ácidos e Bases Oxi-Redução Termoquímica Eletroquímica etc.4) Execução de Experimentos Simples e que Correlacionem o Aspecto Conceitual ao Cotidiano no que se Refere a Análise e/ou Preparação de Materiais, tais como: Polímeros, Pigmentos e Corantes, Metais, Alimentos, Bebidas, Medicamentos, Cosméticos, Detergentes.",
    "7": "DESENHO MECANICO ASSISTIDO POR COMPUTADOR 1 Objetivos da Disciplina: A disciplina objetiva o desenvolvimento de competências, habilidades e atitudes na leitura, interpretação e execução de desenhos técnicos segundo as normas brasileiras. Ao final do curso, o aluno terá desenvolvimendo suas competências (conhecimentos) e habilidades na utilização da Geometria Descritiva para leitura e execuçaão de desenhos técnicos sendo capaz de utilizar os métodos descritivos da geometria, o sistema de cortes e fazendo uso de vistas auxiliares. Espera-se também que o mesmo seja capaz de aplicar as normas de desenho técnicos brasileiras para a representação e cotagem de elementos de máquinas comuns à Engenharia Mecânica, bem como para a confecção de desenhos arquitetônicos, elétricos e hidráulicos simples. Objetiva-se também que o aluno desenvolva suas habilidades na execução de desenhos a mão-livre e usando o computador como ferramenta de desenho. Espera-se, ainda, que o aluno desenvolva uma atitude profissional condizente com sua futura atuação como engenheiro na atuação como engenheiro na realização de trabalhos técnicos e no cumprimento de suas responsabilidade. - Normas de desenho Técnico- Introdução ao CAD- Geometria Descritiva - CAD Básico - Projeção Ortogonal- Desenho a mão-livre- Comandos básicos de construção e edição no CAD- Cotagem e Indicação de tolerâncias- Textos e Blocos - Vistas em Cortes e Vistas Auxiliares- Hachuras no CAD- Desenho Isométrico- Desenho Isométrico no CAD 2D- Sinais de Acabamento e simbologia de soldagem- Impressão no CAD- Roscas, Parafusos e Rebites - Polias, Chavetas, Rolamentos e Engrenagens- Desenho Arquitetônico, Desenho Elétrico e Hidraúlico.",
    "8": "PROBABILIDADE E ESTATÍSTICA Análise Descritiva, Cálculo de Probabilidades, Variáveis Aleatórias Discretas, Variáveis Aleatórias Contínuas, Variáveis Aleatórias Multidimensionais, Noções de Amostragem e Estimação, Testes de Hipóteses. UNIDADE I - Análise Descritiva de Dados - População e amostra, Tipos de variáveis. Distribuição de frequências, Gráficos e medidas resumo. UNIDADE II - Cálculo de Probabilidades - Espaço amostral e eventos, Axiomas de probabilidade, Probabilidade condicional, Lei da multiplicação, Teorema da probabilidade total, Teorema de Bayes. UNIDADE III - Variáveis Aleatórias Discretas - Definição e estudo de caso, Função densidade de massa, Função distribuição, Valor esperado e variância, Principais modelos: Uniforme Discreta, Bernoulli, Binomial, Geométrica, Hipergeométrica e Poisson, Aproximação Poisson à binomial. UNIDADE IV - Variáveis Aleatórias Contínuas - Definição e estudo de caso, Função densidade de probabilidade, Função distribuição, Valor esperado e variância, Principais modelos: Uniforme Contínua, Exponencial, Normal e t-Student. Função de uma variável aleatória. UNIDADE V - Variáveis Aleatórias Multidimensionais - Distribuição conjunta (caso discreto), Variáveis aleatórias independentes, Soma de variáveis aleatórias independentes, Funções de variáveis aleatórias, Esperança de uma função de variáveis aleatórias, Covariância e correlação, Distribuição condicional (caso discreto). UNIDADE VI - Noções de Amostragem e Estimação - Introdução à amostragem, Amostra aleatória simples, Distribuição amostral da média e proporção, Teorema Limite Central, Estimação pontual: método dos momentos, Estimação pontual: máxima verossimilhança, Intervalos de confiança para a média e proporção, Intervalos de confiança para a diferença de médias (populações normais, variâncias conhecidas e amostras independentes). UNIDADE VII - Testes de Hipóteses - Teste para a média com variância conhecida, Teste para a média com variância desconhecida, Teste para a proporção, O poder de um teste, O p-valor.",
    "9": "FISICA 2 Módulos 1: Equilíbrio e elasticidade 2: Gravitação 3: Mecanica dos fluidos 4: Movimento periodico 5: Ondas mecanicas 6: Modos normais e som 7: Fenomenos ondulatórios 8: Temperatura e calor 9: Propriedades termicas da matéria 10: Trabalho e primeira lei da termodinamica 11: Gases ideais e Processos termodinâmicos 12: Segunda lei da termodinâmica. 1-CONTEUDO TEORICO 1-DINAMICA DA ROTACAO 1.1- TORQUE SOBRE UMA PARTICULA 1.2- MOMENTO ANGULAR DE UMA PARTICULA E DE UM SISTEMA DE PARTICULAS. 1.3- ENERGIA CINETICA DE ROTACAO E MOMENTO DE INERCIA. 1.4- DINAMICA DE ROTACAO DE UM CORPO RIGILO. 1.5- MOVIMENTO COMBINADO DE TRANSLACAO E ROTACAO DE UM CORPO RIGIDO. 2- CONSERVACAO DO MOMENTUM ANGULAR 2.1- O PIAO 2.2- MOMENTO ANGULAR E VELOCIDADE ANGULAR. 3- OSCILACOES 3.1- O OSCILADOR HARMONICO SIMPLES E O MOVIMENTO HARMONICO SIMPLES (MHS). 3.2- A ENERGIA NO MHS. 3.3- MHS E MCU 3.4- SUPERPOSICAO DE MHS. 3.5- MOVIMENTO ACOPLADO. 3.6- MOVIMENTO HARMONICO AMORTECIDO. 3.7- OSCILACOES FORCADAS E RESSONANCIA. 4- GRAVITACAO 4.1- HSITORICO 4.2- ALEI DA GRAVITACAO UNIVERSAL E A CONSTANTE G. 4.3- MASSA INERCIAL E GRAVITACIONAL DE UMA DISTRIBUICAO ESFERICA DE MASSA. 4.4- OS MOVIMENTOS DOS PLANETAS E SATELITES. 4.5- EFEITO GRAVITACIONAL DE UMA DISTRIBUICAO ESFERICA DE MASSA. 4.6- O CAMPO GRAVITACIONAL E A ENERGIA POTENCIAL GRAVITACIONAL. 4.7- ENERGIA POTENCIAL PARA UM SISTEMA DE MUITAS PARTICULAS. 4,8- A TERRA COMO REFERENCIAL INERCIAL. 4.9- O PRINCIPIO DE EQUIVALENCIA. 5- ESTATICA DOS FLUIDOS 5.1- FLUIDOS 5.2- PRESSAO E MASSA ESPECIFICA 5.3- VARIACAO DE PRESSAO EM UM FLUIDO EM REPOUSO. 5.4- PRINCIPIO DE PASCAL E ARQUIMEDES. 5.5- MEDIDOR DE PRESSAO. 6- DINAMICA DOS FLUIDOS 6.1- ESCOAMENTO DE FLUIDO 6.2- LINHAS DE CORRENTE 6.3- EQUACAO DE CONTINUIDADE 6.4- EQUACAO DE BERNOULLI 6.5- CONSERVACAO DO MOMENTO NA MECANICA DOS FLUIDOS. 6.6- CAMPOS DE ESCOAMENTO. 7- ONDAS EM MEIOS ELASTICOS 7.1- ONDAS MECANICAS E TIPOS DE ONDAS. 7.2- ONDAS PROGRESSIVAS E ESTACIONARIAS. 7.3- O PRINCIPIO DA SUPERPOSICAO. 7.4- VELOCIDADE DE ONDA. 7.5- POTENCIA E INTENSIDADE DE UMA ONDA. 7.6- INTERFERENCIA DE ONDAS. 7.7- RESSONANCIA. 8- ONDAS SONORAS 8.1- ONDAS AUDIVEIS, ULTRA-SONICAS E INFRA-SONICAS. 8.2- PROGRAMACAO E VELOCIDADE DE ONDAS LONGITUDINAIS. 8.3- ONDAS LONGITUDINAIS ESTACIONARIAS. 8.4- SISTEMAS VIBRANTES E FONTES SONORAS. 8.5- BATIMENTOS. 8.6- EFEITO DOPLER E ONDAS DE CHOQUE. 9- TEMPERATURA 9.1- EQUILIBRIO TERMICO E A LEI ZERO DA TERMODINAMICA. 9.2- MEDIDA DA TEMPERATURA. 9.3- A ESCALA TERMOMETRICA DE UM GAS IDEAL. 9.4- AS ESCALAS CELSIUS E FARENHEIT. 9.5- A ESCALA TERMOMETRICA PRATICA INTERNACIONAL. 9.6- A DILATACAO TERMICA LINEAR SUPERFICIAL VOLUMETRICA 9.7- TENSOES TERMICAS 10- CALOR E A 1a. LEI DA TERMODINAMICA 10.1- CALOR UMA FORMA DE ENERGIA. 10.2- MEDIDA DE CALOR CALOR ESPECIFICO E CAPACIDADE TERMICA 10.3- CAPACIDADE TERMICA MOLAR DOS SOLIDOS. 10.4- FORMAS DE TRANSMMISSAO DE CALOR: CONDUCAO, CONVECCAO E RADIACAO. 10.5- EQUIVALENTE MECANICO DO CALOR. 10.6- CALOR E TRABALHO. 1a. LEI DA TERMODINAMICA. 11- TEORIA CINETICA DOS GASES 11.1- GAS IDEAL: DIFINICOES, MICROSCOPICA E MACROSCOPICA. 11.2- CALCULO CINETICO DA PRESSAO. 11.3- INTERPRETACAO CINETICA DA TEMPERATURA. 11.4- FORCAS INTERMOLECULARES. 11.5- CALOR ESPECIFICO DE UM GAS IDEAL. 11.6- EQUIPARTICAO DE ENERGIA. 11.7- LIVRE PERCURSO MEDIO. 11.8- DISTRIBUICAO DE VELOCIDADES MOLECULARES. A DISTRIBUICAO DE MAXWELL-BOLTZMANN. 11.9- MOVIMENTO BROWNIANO. 11.10- EQUACAO DE ESTADO DE VAN DER WAALS. 12- ENTROPIA E 2a. LEI DA TERMODINAMICA 12.1- TRANSFORMACOES REVERSIVEIS E IRREVERSIVEIS. 12.2- O CICLO DE CARNOT E A 2a. LEI DA TERMODINAMICA. 12.3- O RENDIMENTO DAS MAQUINAS. 12.4- A ESCALA TERMODINAMICA DE TEMPERATURA. 12.5- ENTROPIA: PROCESSOS REVERSIVEIS E IRREVERSIVEIS. 12.6- ENTROPIA E 2a. LEI 12.7- ENTROPIA E DESORDEM",
    "10": "FISICA 2 EXPERIMENTAL GIROSCOPIO. MOVIMENTO PERIODICO. HIDROSTATICA. ONDAS SONORAS. DILATACAO LINEAR. CALOR ESPECIFICO. DOS SOLIDOS. CONDUCAO DE CALOR. COMPORTAMENTO DO GASES. I-DINAMICA DE ROTACAO. ESTUDO DO GIROSCOPIO. TORQUES. MOMENTOS DE INERCIA. CONSERVACAO DO MOMENTO ANGULAR. II-MOVIMENTO HARMONICO SIMPLES. PENDULO SIMPLES. III-PRINCIPIO DE ARQUIMEDES. CALCULO DO EMPUXO. DENSIDADE. COEFICIENTE DE VISCOSIDADE. IV-VELOCIDADE DE PROPAGACAO DO SOM NO AR. MEDIDAS DO COMPRIMENTO DE ONDA. V-OBTENCAO DO COEFICIENTE DE EXPANSAO LINEAR. CALOR ESPECIFICO DE SOLIDOS. VI-GASES IDEAIS E REAIS. MEDIDAS DE PRESSAO. EQUACOES DE ESTADO.",
    "11": "CÁLCULO 2 Sequências e séries numéricas séries de potências fórmula de Taylor equações diferenciais ordinárias de 1ª ordem equações diferenciais ordinárias lineares o método da série de potências a transformada de Laplace sistemas lineares de equações diferenciais ordinárias de 1ª ordem. 1. Sequências Séries numéricas2. Séries de potências: Soma, diferença, produto e quociente de séries de potências. Derivação e integração de Séries de Potências. Aplicações3. Fórmula de Taylor, estimativa de resto e aproximações (Funções de uma Variável)4. Equações diferenciais ordinárias de 1a ordem: motivação interpretação geométrica equações com variáveis separadas fatores integrantes equações lineares de 1ª ordem Método da Variação de Parâmetros família de curvas ortogonais a uma dada família de curvas aplicações Teorema de Existência e Unicidade para o problema de valor inicial (sem demonstração)5. Equações diferenciais ordinárias lineares: oscilador harmônico equações de 2ª ordem com coeficientes constantes problema de valor inicial equação característica sistema fundamental de soluções solução geral oscilações livres equações de ordem arbitrária com coeficientes constantes, caso homogêneo e não homogêneo Métodos dos coeficientes a determinar Método de Variação de Parâmetros. Oscilações forçadas outras aplicações6. O método das séries de potências: A equação de Cauchy equações lineares com coeficientes variáveis resolução através de séries de potências equação de Legendre polinômios de Legengre Método de Frobenius equação indicial7. Transformada de Laplace: integrais impróprias, definição, propriedades básicas e exemplos relação com a derivada e integral aplicações à equações diferenciais8. Sistemas lineares de equações diferenciais ordinárias de 1a ordem: motivação sistemas lineares homogêneos com coeficientes constantes plano de fase",
    "12": "INTRODUCAO A ALGEBRA LINEAR Sistemas lineares e matrizes Espaços vetoriais Produto interno Transformações lineares Autovalores e autovetores Diagonalização de operadores Aplicações. 1. Sistemas lineares e matrizes: operações elementares e forma escada inversão de matrizes por operações elementares determinantes e suas propriedades2. Espaços vetoriais: vetores no plano e no espaço espaços euclidianos R^2 e R^3 produto escalar projeções produto vetorial volume de paralelepípedos retas e planos espaços e subespaços vetoriais combinação linear, dependência e independência linear base de um espaço vetorial3. Produto interno: definição de produto interno exemplos norma, ângulo entre vetores processo de ortogonalização de Gram-Schmidt 4. Transformações lineares: transformações lineares do plano no plano aplicações lineares e matrizes mudança de base5. Autovalores e autovetores: definição de autovalores e autovetores polinômio caracteristico6. Diagonalização de operadores: base de autovetores transformações ortogonais7. Aplicações",
    "13": "ESTRUTURAS DE DADOS Gerenciamento dinâmico da memória. Listas. Pilhas. Filas. Árvores. Ordenação e Pesquisa.Pesquisa em Árvores. Grafos. Análise e aplicação de estruturas avançadas em problemas de programação. Resolução de problemas. Aplicações em problemas ambientais. Gerenciamento dinâmico da memória.Listas. Pilhas. Filas. Árvores. Ordenação e Pesquisa.Pesquisa em Árvores. Grafos. Análise e aplicação de estruturas avançadas em problemas de programação. Resolução de problemas. Aplicações em problemas ambientais.",
    "14": "MECANICA 1 INTRODUCAO CONCEITOS BASICOS EQUILIBRIO DE CORPOS RIGIDOS EQUILIBRIO DE ESTRUTURAS ESFORCOS INTERNOS PRINCIPIOS DOS TRABALHOS VIRTUAIS E ENERGIA POTENCIAL FUNDAMENTOS DE ESTABILIDADE TRACAO EM BARRAS APLICACOES COMPUTACIONAIS E EXPERIMENTAIS. * objetivos da disciplinas: Desenvolver no aluno a capacidade de analisar e resolver problemas com base no estudo das forças e seus efeitos, aplicado na solução destes problemas alguns conceitos básicos e princípios fundamentais da física e, em particular, da mecânica dos corpos rígidos, dentro do âmbito da estática e tendo em vista a aplicação na engenharia. 1.0 - INTRODUÇÃO 1.1 - Domínio da mecânica 1.2 - A modelagem estática de sistemas mecânicos. 2.0 - CONCEITOS BÁSICOS 2.1 - Centroides e centros de massa 2.2 - Vetores e algebra matrical 2.3 - Forças e momentos 2.4 - Equilíbrio de partículas. 3.0 - EQUILÍBRIO DE CORPOS RÍGIDOS 3.1 - Diagrama de corpo livre 3.2 - EquilÍbrio de forças e momentos 3.3 - Graus de Liberdade e Vinculos. 4.0 - EQUILÍBRIO DE ESTRUTURAS 4.1 - Trelicas 4.2 - Portiços 4.3 - Mecanismos. 5.0 - ESFORÇOS INTERNOS 5.1 - Forças normais e cortantes, momentos fletores e torções 5.2 - Diagramas de esforcos 5.3 - Relações diferentes entre os esforços internos. 6.0 - PRINCÍPIOS DOS TRABALHOS VIRTUAIS E ENERGIA POTENCIAL 6.1 - Trabalho virtual 6.2 - Energia potencial. 7.0 - FUNDAMENTOS DE ESTABILIDADE 7.1 - Aplicações em estruturas 7.2 - Estabilidade de sistema de corpos rígidos e vinculações elásticas. 8.0 - TRAÇÃO EM BARRAS 8.1 - Barras tracionadas: hipotése cinemática 8.2 - Conceito de tensão normal 8.3 - Deformação em barras elásticas. 8.4 - Relação constitutiva elástica linear 8.5 - Problemas de equilíbrio 8.6 - Dimensionamento para resistência.",
    "15": "FISICA 3 LEI DE COULOMB. O CAMPO ELETRICO - LEI DE GAUSS. POTENCIAL, CAPACITANCIA, PROPRIEDADE DOS DIELETRICOS. CORRENTE, RESISTENCIA E FEM. CIRCUITOS E INSTRUMENTOS DE CORRENTE CONTINUA. O CAMPO MAGNETICO. FORCAS MAGNETICAS SOBRE CONDUTORES DE CORRENTES. CAMPO MAGNETICO PRODUZIDO POR CORRENTES. FORCA ELETROMOTRIZ INDUZIDA. CORRENTES ALTERNADAS. EQUACOES DE MAXWELL. I-LEI DE COULOMB. CONSERVACAO DA CARGA. CAMPO ELETRICO. DIPOLO ELETRICO. LEI DE GAUSS. FLUXO ELETRICO. II-POTENCIAL DE CARGAS DISCRETAS E DE UM DIPOLO. POTENCIAL DE UMA DISTRIBUICAO CONTINUA DE CARGAS. GRADIENTE DE POTENCIAL. III-CAPACITOR. CALCULO DA CAPACITANCIA. DIELETRICOS. VETORES ELETRICOS. VISAO MICROSCOPICA DOS DIELETRICOS. IV-CORRENTE ELETRICA. RESISTIVIDADE. LEI DE OHM. TRANSFERENCIA DE ENERGIA NUM CIRCUITO ELETRICO. FEM. CIRCUITOS DE MALHA UNICA. LEI DAS MALHAS. CIRCUITOS RC. AMOERIMETRO, VOLTIMETRO, OHMIMETRO, POTENCIOMETRO. V-CONCEITO DE CAMPO MAGNETICO. FORCA MAGNETICA. TORQUE SOBRE UMA ESPIRA. EFEITO HALL. TRAJETORIA DE UMA CARGA NUM CAMPO MAGNETICO. VI-LEI DE AMPERE. LINHAS DE CAMPO MAGNETICO. LEI DE BIOT-SOVART. SOLENOIDE. LEI DE FARRADAY E DE LENZ. CAMPOS MAGNETICOS DEPENDENTES DO TEMPO. VII-INDUTOR. CALCULO DA INDUTANCIA. CIRCUITO LR. DENSIDADE DE ENERGIA. OSCILACOES DOS CIRCUITOS LC. VIII-CORRENTE ALTERNADA. CIRCUITOS LRC. POTENCIA EM CIRCUITOS ALTERNADOS. RESSONANCIA. FILTROS E RETIFICADORES. TRANSFORMADORES. IX-CAMPOS MAGNETICOS INDUZIDOS. CORRENTE DE DESLOCAMENTO. AS EQUACOES DE MAXWELL.",
    "16": "FISICA 3 EXPERIMENTAL  FUNDAMENTOS TEÓRICOS USO DE MEDIDORES ELÉTRICOS E FONTES RESISTÊNCIA ELÉTRICA OHMICA E NÃO OHMICA FONTE DE TENSÃO FEM E RESISTÊNCIA INTERNA PONTE DE WHEATSTONE MEDIDAS DE RESISTÊNCIAS, SUPERFÍCIES EQUIPOTENCIAIS E LINHAS DE CAMPO DEFLEXÃO ELETROMAGNÉTICA DE ELÉTRONS CAPACITORES SOB CORRENTES CC FORÇA MAGNÉTICA SOBRE SEGMENTOS RETILÍNEOS DE CORRENTES AS BOBUNAS DE HELMHOLTZ E A RAZÃO e/m PARA O ELÉTRON CIRCUITOS COM CORRENTES ALTERNADAS RESSONÂNCIA NO CIRCUITO RLC SÉRIE TRANSFORMADORES E CIRCUITOS RETIFICADORES. EXPERIENCIA 1 - USO DE MEDIDORES ELÉTRICOS E FONTES DE TENSÃO 1.1- FONTES DE ALIMENTACÃO 1.2- MULTIMETROS: VOLTÍMETRO, AMPERÍMETRO E OHMÍMETRO 1.3- MONTAGEM DE CIRCUITOS DE UMA MALHA EXPERIENCIA 2 - RESISTÊNCIA ELÉTRICA 2.1- RESISTORES OHMICOS 2.2- RESISTORES NÃO OHMICOS (DIODO) 2.3- CURVA CARACTERÍSTICA DE UM RESISTOR 2.4- RETA DE CARGA EXPERIENCIA 3 - FONTE DE TENSÃO 3.1- CURVA DE REGULAÇÃO DE UMA FONTE 3.2- FORÇA ELETROMOTRIZ3.3- RESISTENCIA INTERNA EXPERIENCIA 4 - PONTE DE WHEATSTONE 4.1- MONTAGEM DE CIRCUITO COM DIVERSAS MALHA 4.2- MEDIDAS DE RESISTÊNCIA USANDO A PONTE 4.3- LEVANTAR A CONFIGURAÇÃO DE SUPERFÍCIES E EQUIPOTENCIAIS DE UM CAMPO ELÉTRICO 4.4- COMPORTAMENTO DE LINHAS DE CAMPO ELÉTRICO PRÓXIMO A CONDUTORES E ISOLANTES EXPERIENCIA 5 - DEFLEXÕES ELETROMAGNÉTICA DE ELÉTRONS 5.1- TUBO DE RAIOS CATÓDICOS 5.2- UTILIZAÇÃO DE FONTE DE ALTA TENSÃO (HEATHKIT5.3- DEFLEXÃO EM UM CAMPO ELÉTRICO5.4- DEFLEXÃO EM UM CAMPO MAGNÉTICO EXPERIENCIA 6 - CAPACITORES ALIMENTATADOS COM CORRENTE CONTÍNUA6.1- OSCILOSCÓPIO 6.2- CIRCUITO RC SÉRIE - CC 6.3- USO DO OSCILOSCÓPIO NA OBSERVAÇÃO DA CARGA E DESCARGA DE UM CAPACITOR6.4- MEDIDA DA CONSTANTE DE TEMPO CAPACITIVA EXPERIENCIA 7 - FORÇA MAGNÉTICA EM SEGMENTOS RETILÍNEOS DE CORRENTE 7.1- NOVOS INSTRUMENTOS: ELETROMAGNETICO, BALANÇA COM VERNIER, TESLÍMETRO COM SONDA HALL E FONTES DE TENSÃO 7.2- FORÇA DEVIDA A UM CAMPO MAGNÉTICO VERSUS COMPRIMENTO DO SEGMENTO DE CORRENTE 7.3- FORÇA VERSUS DIREÇÃO DO CAMPO MAGNÉTICO7.4- FORÇA VERSUS A INTENSIDADE DA CORRENTE DO SEGMENTO7.5- MEDIDAS DE CAMPO MAGNÉTICO USANDO O TESLÍMETRO EXPERIENCIA 8 - AS BOBINAS DE HELMHOLTZ E A RAZÃO e/m PARA O ELÉTRON 8.1- CAMPO MAGNÉTICO NO EIXO DE UMA ESPIRA8.2- CAMPO MAGNÉTICO NA REGIÃO CENTRAL DAS BOBINAS DE HELMHOLTZ8.3- ORBITAS DE ELÉTRONS NUM CAMPO MAGNÉTICO UNIFORME8.4- DETERMINAÇÃO DA RAZÃO e/m PARA O ELÉTRON EXPERIENCIA 9 - CIRCUITOS ALIMENTADOS COM CORRENTE ALTERNADA (CA)9.1- INDUTOR E INDUTÂNCIA, L 9.2- MEDIDAS DE TENSÃO E CORRENTE, VALORES EFICAZES, - CA 9.3- CIRCUITOS RL, RC, RLC, EM SÉRIE - CA 9.4- FREQUÊNCIA, IMPEDÂNCIA, REATÂNCIA E FATOR DE POTÊNCIA - CA9.5- DIAGRAMAS ROTORIAIS EXPERIÊNCIA 10 - RESSONÂNCIA, O OSCILADOR ELETROMAGNÉTICO FORÇADO10.1- COMPORTAMENTO DA AMPLITUDE DE CORRENTE COM FREQUÊNCIA10.2- FREQUÊNCIA DE RESSONÂNCIA10.3- ÂNGULO DE FASE VERSUS FREQUÊNCIA10.4- INDUÇÃO NUM CIRCUITO ISOLADO - LEI DE FARADAY EXPERIÊNCIA 11 - TRANSFORMADORES E CIRCUITOS RETIFICADORES11.1- O TRANSFORMADOR11.2- RETIFICADOR DE MEIA ONDA SEM E COM FILTRO CAPACITIVO11.3- RETIFICADOR DEONDA COMPLETA SEM E COM FILTRO CAPACITIVO11.4- RETIFICADOR DE ONDA COMPLETA COM PONTE DE DIODO, COM E SEM FILTRO CAPACITIVO11.5- RETIFICADOR DE ONDA COMPLETA COM PONTE DE DIODO, FILTRO CAPACITIVO E REGULADOR DE TENSÃO.",
    "17": "CÁLCULO 3 Vetores no plano e no espaço funções de várias variáveis fórmula de Taylor e aplicações transformações diferenciáveis o teorema da função inversa e da função Implícita. 1. Vetores no plano e no espaço: conceito e propriedades. Produto escalar, Vetorial e misto, projeções. Vetor tangente e normal unitários. Vetores velocidade e aceleração. Aplicações. Campos vetoriais no plano e no espaço2. Funções de várias variáveis (com ênfase em funções de duas e três variáveis): gráficos, curvas de nível e superfícies de nível. Limites e continuidade: conceito, propriedades e interpretação geométrica e como taxa de variação. Derivadas parciais: conceito, propriedades, interpretação geométrica e como taxa de variação, derivadas parciais de ordem superior, igualdade entre derivadas mistas. Diferenciabilidade e a diferencial total: conceito, propriedades, interpretação geométrica. Plano tangente. Regra da Cadeia e derivação implícita. Derivadas direcionais e vetor gradiente: conceito, propriedades, interpretação geométrica e como taxa de variação3. Fórmula de Taylor, pontos de extremos locais e absolutos. Pontos críticos. Multiplicadores de Lagrange. Aplicações em problemas de otimização4. Transformações diferenciáveis: a derivada como transformação linerar, Matrizes e Determinantes Jacobianos, A regra da cadeia geral, Teorema da Função Inversa, Teorema da função Implícita, derivação implícita5. Integrais múltiplas: Integrais duplas: conceito, propriedades, integração por iteração, cálculo de áreas, volumes e outras aplicações, integrais duplas em coordenadas polares, transformações no plano, o Jacobiano de uma transformação, mudanças de coordenadas em integrais duplas. Integrais triplas: conceito, propriedades, integração por iteração, cálculo de volumes e outras aplicações, Integrais triplas em coordenadas cilíndricas e esféricas, transformações no espaço, o Jacobiano de uma transformação, mudanças de coordenadas em integrais triplas6. Integrais de linha: curvas parametrizadas no plano e no espaço, parametrização de gráficos de funções, segmentos de retas, arcos de circunferências, arcos de elipses e outras curvas básicas. Integrais de linha de campos vetoriais: conceito, propriedades. Cálculo de integrais de linha por parametrização. Campos gradientes, função potencial e integrais de linha. Teorema de Green. Aplicações: cálculo do trabalho de um campo de forças e outras aplicações7. Integrais de superfícies, Teorema da Divergência e Teorema de Stokes: parametrização de gráficos de funções, superfícies de revolução, superfícies esféricas, superfícies planas e outras superfícies básicas. Vetores normais a uma superfície e superfície suave. Integrais de superfície: conceito e propriedades, cálculo de integrais de superfícies parametrizadas, cálculo de áreas de superfície e outras aplicações. Teorema da Divergência e de Stokes: fluxo de um campo vetorial através de uma superfície, superfícies orientáveis e superfícies com bordo, Teorema da Divergência e a Lei de Gauss para campos de quadrado inverso, Teorema de Stokes e aplicações.",
    "18": "SINAIS E SISTEMAS EM TEMPO CONTÍNUO Sinais e sistemas. Análise no domínio do tempo de sistemas de tempo contínuo. Análise de sistemas de tempo contínuo usando a transformada de Laplace. Análise de sinais periódicos de tempo contínuo: a série de Fourier. Análise de sinais aperiódicos de tempo contínuo: a transformada de Fourier. Análise no espaço de estados de sistemas de tempo contínuo. 1. SINAIS E SISTEMAS1.1. Introdução1.2. Tamanho de um sinal1.3. Classificação de sinais1.4. Algumas operações com sinais1.5. Funções pares e ímpares1.6. Sistemas1.7. Classificação de sistemas1.8. Modelagem de sistema: descrição entrada-saída1.9. Descrições interna e externa de um sistema1.10. Descrição interna: a descrição no espaço de estados2. ANÁLISE NO DOMÍNIO DO TEMPO DE SISTEMAS DE TEMPO CONTÍNUO2.1. Introdução2.2. Resposta de um sistema às condições internas: a resposta com entrada zero2.3. Resposta ao impulso unitário2.4. Resposta ao degrau unitário2.5. Resposta de um sistema a uma excitação externa: a resposta com estado zero2.6. Solução clássica de equações diferenciais2.7. Estabilidade de sistemas2.8. Insights intuitivos sobre comportamento de um sistema3. ANÁLISE DE SISTEMAS DE TEMPO CONTÍNUO USANDO A TRANSFORMADA DE LAPLACE3.1. A transformada de Laplace3.2. Algumas propriedades da transformada de Laplace3.3. Solução de equações diferenciais e integro-diferenciais3.4. Análise de circuitos elétricos: o circuito transformado3.5. Diagramas de bloco3.6. Realização de sistemas3.7. Aplicação em realimentação e controle3.8. Resposta de frequência de um sistema LIT3.9. Diagramas de Bode3.10. Projeto de filtros pelo posicionamento dos pólos e zeros de H(s)3.11. A transformada de Laplace bilateral4. ANÁLISE DE SINAIS PERIÓDICOS DE TEMPO CONTÍNUO: A SÉRIE DE FOURIER4.1. Representação de sinais periódicos pela série de Fourier trigonométrica4.2. Existência e convergência da série de Fourier 4.3. Série de Fourier exponencial4.4. Resposta de um sistema LIT a entradas periódicas4.5. Série de Fourier generalizada: sinais e vetores4.6. Cálculo numérico dos coeficientes da série de Fourier exponencial 5. ANÁLISE DE SINAIS APERIÓDICOS DE TEMPO CONTÍNUO: A TRANSFORMADA DE FOURIER5.1. Representação de sinais aperiódicos pela integral de Fourier5.2. Transformadas de algumas funções5.3. Algumas propriedades da transformada de Fourier5.4. Transmissão de sinais através de sistemas LIT5.5. Filtros ideais e práticos5.6. Energia de um sinal5.7. Aplicação em comunicações: modulação de amplitude5.8. Truncamento de sinais: funções-janelas6. ANÁLISE NO ESPAÇO DE ESTADOS DE SISTEMAS DE TEMPO CONTÍNUO6.1. Introdução6.2. Um procedimento sistemático para determinar as equações de estado6.3. Solução das equações de estado6.4. Transformação linear de vetores de estado6.5. Controlabilidade e observabilidade",
    "19": "INTRODUÇÃO AOS CIRCUITOS ELÉTRICOS Conceitos básicos.Lei de Ohm.Leis de Kirchhoff.Circuitos resistivos.Técnicas de análise nodal e de laço.Amplificadores Operacionais.Princípio da superposição.Teoremas de Thévenin e de Norton. Conceitos básicos- Sistemas de unidades- Grandezas básicas- Componentes de circuitos Circuitos resistivos- Lei de Ohm- Leis de Kirchhoff - Circuitos de laço único- Circuitos com um par de nós- Combinação de resistores- Transformações delta? estrela- Circuitos com fontes dependentes Técnicas de análise nodal e de malhas- Introdução- Análise nodal- Análise de malhas Amplificadores Operacionais- Introdução- Modelos de amplificadores operacionais- Circuitos básicos com amp-op Técnicas adicionais de análise- Princípio da superposição- Transformação de fontes- Teoremas de Thévenin e de Norton- Máxima transferência de energia",
    "20": "CIRCUITOS LÓGICOS Álgebra Booleana. Estruturas de Portas Lógicas. Circuitos Combinacionais. Memórias. Circuitos Sequenciais. Conversão A/D e D/A. 1. Introdução 1.1. Grandezas digitais e analógicas 1.2. Sistemas de numeração1.3. Códigos Binário, BCD, Gray1.4. Representação numérica2. Álgebra Booleana2.1. Teoremas de DeMorgan2.2. Manipulação de expressões algébricas2.3. Métodos de minimização 2.3.1. Mapa de Karnaugh 2.3.2. Algoritmo de Quine-Mcluskey 3. Estruturas de Elementos Digitais3.1. Tecnologias TTL e CMOS 3.2. Portas lógicas3.3. Buffer Tri-State4. Circuitos Combinacionais 4.1. Multiplexadores / Demultiplexadores4.2. Codificadores / Decodificadores4.3. Circuitos aritméticos4.4. Projeto de circuitos combinacionais5. Elementos de Estado5.1. Latches5.2. Flip-Flops5.3. Registradores5.4. Memórias ROM, SRAM e DRAM6. Circuitos Sequenciais6.1. Contadores síncronos e assíncronos6.2. Máquinas de Estados Finitos - Moore e Mealy6.3. Projeto de circuitos sequenciais 7. Conversores de Sinais7.1. Amplificador Operacional7.1. Conversores Digital/Analógico7.2. Conversores Analógico/Digital",
    "21": "LABORATÓRIO DE CIRCUITOS LÓGICOS Linguagem de Descrição de Hardware. Portas Lógicas. Circuitos Combinacionais. Elementos de Estado. Circuitos Sequenciais. Conversão A/D e D/A. Projeto aplicativo. 1. Introdução 1.1. Instrumental básico 1.2. Prototipação em protoboard1.3. Linguagens de Descrição de Hardware (HDL)1.4. Prototipação em FPGA2. Álgebra Booleana2.1. Teoremas de DeMorgan2.2. Manipulação de expressões algébricas2.3. Métodos de minimização 2.3.1. Mapa de Karnaugh 2.3.2. Algoritmo de Quine-Mcluskey 3. Estruturas de Elementos Digitais3.1. Tecnologias TTL e CMOS 3.2. Portas lógicas3.3. Buffer Tri-State4. Circuitos Combinacionais 4.1. Multiplexadores / Demultiplexadores4.2. Codificadores / Decodificadores4.3. Circuitos aritméticos4.4. Projeto de circuitos combinacionais5. Elementos de Estado5.1. Latches5.2. Flip-Flops5.3. Registradores5.4. Memórias ROM, SRAM e DRAM6. Circuitos Sequenciais6.1. Contadores síncronos e assíncronos6.2. Máquinas de Estados Finitos - Moore e Mealy6.3. Projeto de circuitos sequenciais 7. Conversores de Sinais7.1. Amplificador operacional7.1. Conversores Digital/Analógico7.2. Conversores Analógico/Digital8. Projeto Aplicativo",
    "22": "MECANICA 2 INTRODUÇÃO CONCEITOS BÁSICOS MÉTODOS DE ENERGIA CINEMÁTICA DE CORPOS RÍGIDOSDINÂMICA DOS SISTEMAS DE PARTÍCULASDINÂMICA DECORPOS RÍGIDOS APLICAÇÕES EXPERIMENTAIS E COMPUTACIONAIS. 1.0 - INTRODUÇÃO 1.1 - Modelagem dinâmica de sistemas mecânicos 1.2 - Domínio da mecânica. 2.0 - CONCEITOS BÁSICOS 2.1 - Movimento de um ponto. 2.1.1 - Tipos de movimentos. 2.2 - Força, massa e aceleração. 2.2.1 - Equações de movimento para o centro de massa 2.2.2 - Movimento de Inércia. 3.0 - MÉTODOS DE ENERGIA 3.1 - Trabalho e energia cinética 3.2 - Energia potencial 3.3 - Impulsão, momento linear e momento angular. 4.0 - CINEMÁTICA DE CORPOS RÍGIDOS 4.1 - Corpos rigidos e tipos de movimento 4.2 - Cinemática de corpos rigidos no espaço 4.2.1 - Velocidade 4.2.2 - Aceleração 4.2.3 - Movimento de sistemas de referência. 4.3 - Particularização: cinemática de corpos rígidos no plano 4.4 - Noções gerais mecanismos 4.5 - Contatos deslizantes 4.6 - Mecanismos planos articulados 4.7 - Rotação sem deslizamento. 5.0 - DIMÂMICA DOS SISTEMAS DE PARTÍCULAS 5.1 - Equações de movimento para um sistema de partículas 5.2 - trabalho e energia 5.3 - Impulsão, momento linear e momento angular. 6.0 - DINÂMICA DE CORPOS RÍGIDOS 6.1 - Dinâmica de corpos rígidos no espaço 6.1.1 - Balanço de momento linear 6.1.2 - Balanço de momento angular 6.1.3 - Energia cinética 6.1.4 - Equações de Euler 6.1.5 - Movimento giroscópico. 6.2 - Praticularizacao: dinâmica de corpos rígidos no plano 6.3 - Modelagem e simulação de mecanismos planos articulados.",
    "23": "MECANICA DOS MATERIAIS 1 INTRODUCAO A ELASTICIDADE: DEFORMACOES, FORCAS DE CAMPO E DE CONTATO, TENSOR TENSAO DE CAUCHY, TENSOES PRINCIPAISTORCAO DE BAR- RAS DE SECAO CIRCULAR FLEXAO DE VIGAS CRITERIOS DE RESISTENCIA PARA ESTADOS GERAIS DE TENSOES APLICACOES EXPERIMENTAIS E COMPUTACIONAIS. 1.0 - INTRODUCAO A ELASTICIDADE LINEAR 1.1 - Deformacao de um corpo 1.2 - Medida local de deformacao deformacoes principais 1.3 - Forcas externas de campo e de contato 1.4 - Forcas internas: tensor tensao de Cauchy hipotese de Cau- chy 1.5 - Teorema de Cauchy: existencia e simetria do tensor tensao de Cauchy equacao de equilibrio 1.6 - Tensoes principais 1.7 - Relacao constitutiva para o materail calstico linear. 2.0 - TORCAO DE BARRAS DE SECAO CIRCULAR 2.1 - Hipotese cinematica de Bernoulli 2.2 - Distribuicao de tensoes cisalhantes na secao transversal 2.3 - Deformacao de barras sob esforcos de torcao 2.4 - Problemas de equilibrio(isostaticos/hiperestaticos) 2.5 - Dimensionamento. 3.0 - FLEXAO DE VIGAS 3.1 - Hipotese de Bernoulli para flexao de vigas 3.2 - Distribuicao de tensoes normais na secao transversal 3.3 - Distribuicao de tensoes cisalhantes na secao transversal 3.4 - Deflexao de vigas 3.5 - Problemas de equilibrio (isostaticos/hiperestaticos) 3.6 - Dimensionamento. 4.0 - CRITERIOS DE RESISTENCIA PARA ESTADOS GERAIS DE TENSAO 4.1 - Criterio de Tresca 4.2 - Cri8terio de Von Mises 4.3 - Criterio de Coulomb.",
    "24": "VARIAVEL COMPLEXA 1 Números complexos Funções de uma variável complexa A derivada A integral e aplicações Séries de potências Funções conformes 1. Números complexos: representação geométrica valor absoluto complexo conjugado forma polar argumento a álgebra dos números complexos raízes n-ésimas2. Funções de uma variável complexa: funções complexas o conceito de limite teoremas sobre limites continuidade derivada fórmulas de derivação equações de Cauchy-Riemann funções analíticas e funções reais harmônicas as funções exponencial, trigonométricas, hiperbólicas, logarítmicas, potências com expoentes complexos inversa de funções trigonométricas as transformações bilineares propriedades de mapeamento das funções exponenciais e logarítimo 3. Integrais: contornos integrais de linha o Teorema de Cauchy Fórmula integral de Cauchy derivadas de ordem superior Teoremas de Morera, do Módulo Máximo, de Liouville, Fundamental da Álgebra4. Séries de potências: séries de Taylor e Lauren integração e derivação de séries multiplicação e divisão de séries pólos Teorema dos resíduos e aplicações5. Funções conformes: exemplos rotação de tangentes funções harmônicas conjugadas inversas aplicações",
    "25": "SINAIS E SISTEMAS EM TEMPO DISCRETO Sinais e sistemas de tempo discreto. Análise no domínio do tempo de sistemas de tempo discreto. Análise de sistemas de tempo discreto usando a transformada z. Amostragem: a ponte entre contínuo e discreto. Análise de Fourier de sinais de tempo discreto. Análise no espaço de estados de sistemas de tempo discreto. 1. SINAIS E SISTEMAS DE TEMPO DISCRETO1.1. Introdução1.2. Classificação de sinais1.3. Algumas operações com sinais1.4. Sistemas de tempo discreto1.5. Propriedades dos sistemas de tempo discreto1.6. Exemplos de sistemas de tempo discreto2. ANÁLISE NO DOMÍNIO DO TEMPO DE SISTEMAS DE TEMPO DISCRETO2.1. Introdução2.2. Equações de sistemas de tempo discreto2.3. Resposta de um sistema às condições internas: a resposta com entrada zero2.4. Resposta ao impulso unitário2.5. Resposta ao degrau unitário2.6. Resposta de um sistema a uma excitação externa: a resposta com estado zero2.7. Solução clássica de equações de diferenças lineares2.8. Estabilidade de sistemas: o critério BIBO2.9. Insights intuitivos sobre comportamento de um sistema3. ANÁLISE DE SISTEMAS DE TEMPO DISCRETO USANDO A TRANSFORMADA Z3.1. A transformada z3.2. Algumas propriedades da transformada z3.3. Solução de equações de diferenças3.4. Realização de sistemas3.5. Resposta de frequência de sistemas LIT3.6. Resposta de frequência a partir da localização dos pólos e zeros3.7. Processamento digital de sinais analógicos3.8. Conexão entre as transformas de Laplace e z3.9. A transformada z bilateral4. AMOSTRAGEM: A PONTE ENTRE CONTÍNUO E DISCRETO4.1. O teorema da amostragem4.2. Reconstrução de sinal4.3. Conversão analógico-para-digital (A/D)4.4. Dual da amostragem temporal: a amostragem espectral4.5. Cálculo numérico da transformada de Fourier: a transformada de Fourier discreta (DFT)4.6. A transformada rápida de Fourier (FFT)5. ANÁLISE DE FOURIER DE SINAIS DE TEMPO DISCRETO5.1. Série de Fourier de tempo discreto (SFTD)5.2. Representação de sinais aperiódicos pela integral de Fourier: a transformada de Fourier de tempo discreto (TFTD) 5.3. Propriedades da TFTD5.4. Análise de sistemas LIT de tempo discreto usando a TFTD5.5. Conexão entre a TFTD e a TFTC5.6. Generalização da TFTD e a transformada z6. ANÁLISE NO ESPAÇO DE ESTADOS DE SISTEMAS DE TEMPO DISCRETO6.1. Introdução6.2. Um procedimento sistemático para determinar as equações de estado6.3. Solução das equações de estado6.4. Transformação linear de vetores de estado6.5. Controlabilidade e observabilidade",
    "26": "CIRCUITOS ELÉTRICOS Capacitância e indutância.Análise de circuitos de 1ª e 2ª ordem.Análise de circuitos em regime permanente senoidal.Potência em regime permanente senoidal.Circuitos com acoplamento magnético.Desempenho dos circuitos em função da frequência.Aplicação da transformada de Laplace na análise de circuitos.Aplicação das séries e da transformada de Fourier na análise de circuitos.Quadripolos. Capacitância e indutância- Capacitores- Indutores- Combinações de capacitores e indutores- Circuitos RC com amplificador operacionalAnálise de circuitos de 1ª e 2ª ordem - Circuitos de 1ª ordem- Circuitos de 2ª ordemAnálise de circuitos em regime permanente senoidal - Funções forçantes senoidais e complexas- Fasores- Impedância e admitância- Diagramas fasoriais- Análise nodal e de laços de circuitos em regime permanente senoidalPotência em regime permanente senoidal - Potência instantânea e média- Valor eficaz ou rms - Fator de potência - Potência complexa- Correção do fator de potênciaCircuitos com acoplamento magnético - Indutância mútua- Transformadores ideaisDesempenho dos circuitos em função da frequência- Análise da resposta de um circuito em função da frequência- Diagramas de Bode- Circuitos ressonantes- FiltrosAplicação da transformada de Laplace na análise de circuitos- Soluções de circuito por Laplace- Modelos dos elementos de circuito- Técnicas de análise- Função de transferência- Diagramas de pólos e zeros- Resposta de regime permanenteAplicação das séries e da transformada de Fourier na análise de circuitos - Resposta de regime permanente de um circuito excitado por sinal periódico- Uso da transformada de Fourier para determinar a resposta de um circuitoQuadripolos- Parâmetros de admitância- Parâmetros de impedância- Parâmetros híbridos- Parâmetros de transmissão- Conversões de parâmetros- Interconexão de quadripolos",
    "27": "LABORATÓRIO DE CIRCUITOS ELÉTRICOS Experimentos de laboratório acerca dos tópicos seguir:- Lei de Ohm e leis de Kirchhoff.- Amplificadores Operacionais.- Superposição e teoremas de Thévenin e de Norton.- Circuitos de 1ª e 2ª ordem.- Circuitos em regime permanente senoidal.- Potência em regime permanente senoidal.- Circuitos com acoplamento magnético.- Desempenho dos circuitos em função da frequência.- Aplicação da transformada de Laplace na análise de circuitos.- Aplicação das séries e da transformada de Fourier na análise de circuitos.- Quadripolos. Experimentos de laboratório acerca dos seguintes tópicos:- Lei de Ohm e leis de Kirchhoff- Amplificadores Operacionais- Princípio da superposição- Teoremas de Thévenin e de Norton- Circuitos de 1ª e 2ª ordem- Circuitos em regime permanente senoidal- Potência em regime permanente senoidal- Circuitos com acoplamento magnético- Desempenho dos circuitos em função da frequência- Aplicação da transformada de Laplace na análise de circuitos- Aplicação das séries e da transformada de Fourier na análise de circuitos- Quadripolos",
    "28": "CONVERSÃO ELETROMECÂNICA DE ENERGIA Introdução aos princípios de máquinas transformadores fundamentos de máquinas CA geradores síncronos motores de indução fundamentos de máquinas CC motores e geradores CC. 1 ? Introdução aos princípios de máquinas ? Movimento de rotação, lei de Newton e relações de potência ? Circuitos magnéticos ? Lei de Faraday ? Produção de força induzida em um condutor ? Tensão induzida em um condutor que se desloca dentro de um campo magnético e ? Máquina linear CC.2 ? Transformadores ? Tipos e construção de transformadores ? Transformador ideal ? Teoria de operação de transformadores monofásicos reais ? Circuito equivalente ? Sistema de medições por unidade ? Regulação de tensão e eficiência e ? Derivações e regulação de tensão.3 ? Fundamentos de máquinas CA ? Uma espira simples em um campo magnético uniforme ? Campo magnético girante ? Força magnetomotriz e distribuição de fluxo ? Tensão induzida ? Conjugado induzido ? Isolação dos enrolamentos ? Fluxos e perdas de potência e ? Regulação de tensão e regulação de velocidade.4 ? Geradores síncronos ? Aspectos construtivos ? Velocidade de rotação ? Tensão interna gerada ? Circuito equivalente ? Diagrama fasorial ? Potência e conjugado e ? Determinação dos parâmetros do modelo de circuito.5 - Motores de indução ? Aspectos construtivos ? Conjugado e escorregamento ? Circuito equivalente ? Potência e conjugado ? Características de conjugado versus velocidade e ? Determinação dos parâmetros do modelo de circuito.6 - Fundamentos de máquinas CC ? Uma espira simples girando entre faces polares curvadas ? Comutação em uma máquina simples de quatro espiras ? Comutação e construção da armadura em máquinas CC reais ? Problemas de comutação em máquinas reais ? Tensão interna gerada e as equações de conjugado induzido para máquinas CC reais ? Aspectos construtivos e ? Fluxo de potência e perdas.7 - Motores e geradores CC ? Circuito equivalente de um motor CC ? Curva de magnetização de uma máquina CC ? Motores de excitação independente e em derivação ? Motor CC de ímã permanente ? Motor CC série ? Motor CC composto ? Partida dos motores CC ? Controle de velocidade ? Eficiência do motor CC ? Gerador de excitação independente ? Gerador CC em derivação ? Gerador CC série ? Gerador CC composto cumulativo e ? Gerador CC composto diferencial.",
    "29": "LABORATÓRIO DE CONVERSÃO ELETROMECÂNICA DE ENERGIA Ensaios com carga e com transformadores monofásicos. Medições em circuitos trifásicos. Ensaios com motor de indução, máquinas síncronas e de corrente contínua. Laboratório 1: Correção de fator de potência.Laboratório 2: Ensaios em circuito-aberto e em curto-circuito em transformador monofásico.Laboratório 3: Medições em circuitos trifásicos.Laboratório 4: Operação do motor de indução trifásico: partida.Laboratório 5: Operação do motor de indução trifásico: ensaios a vazio e rotor bloqueado.Laboratório 6: Operação do motor síncrono: partida.Laboratório 7: Características de tensão a vazio dos geradores CC com excitação independente.Laboratório 8: Características de tensão vs. carga de geradores CC: excitação independente.Laboratório 9: Características de tensão vs. carga de geradores CC: excitação shunt auto excitado.Laboratório A: Motor CC: controle de velocidade.Laboratório B: Ensaio a vazio e de curto-circuito em máquina síncrona.Laboratório C: Paralelismo da máquina síncrona com a rede elétrica.",
    "30": "INTRODUÇÃO À CIÊNCIA DOS MATERIAIS Programa da disciplina (aulas teóricas).1. Introdução - Os materiais usados em engenharia.2. Estrutura dos Sólidos Cristalinos - Estruturas cristalinas, difração, direções e planos cristalográficos, materiais cristalinos e não-cristalinos.3. Imperfeições em Sólidos - Cristais imperfeitos, defeitos pontuais e lineares, análise microscopica.4. Difusão - Difusão no estado sólido, soluções sólidas.5. Propriedades Mecânicas dos Metais - Conceitos de Tensão-Deformação, Deformação Elástica, Propriedades Elásticas, Deformação Plástica, Escoamento e Limite de Escoamento, Limite de Resistência à Tração, Resiliência, Tenacidade, Durezas Rockwell, Brinell e Knoop.6. Falhas - Fratura, fadiga e fluência7. Diagramas de Fases em Ligas Metálicas- Diagramas binários, sistema ferro- cementita.8. Tratamentos Térmicos- Tratamentos térmicos de ligas ferrosas, endurecimento por precipitação.9. Noções de materiais cerâmicos, plásticos e compósitos. ",
    "31": "TECNOLOGIA DE FABRICACAO 1 PROCESSOS DE FABRICAÇÃO COM REMOÇÃO DE MATERIAS.FUNCIONAMENTOE OPERAÇÃO DAS MÁQUINAS FERRAMENTAIS. FATORES QUE AFETAM A VIDA DA FERRAMENTA,CONSUMO DE POTÊNCIA E ACABAMENTO SUPERFICIAL.ECONOMIA DA USINAGEM. USIANGEM POR ELETROEROSÃO, POR PROCESSOS ELETRO-QUÍMICOS. 1.0 - NOÇÕES FUNDAMENTAIS DE TOLERÂNCIAS E AJUSTES.2.0 - AJUSTAGEM FINA TOLERÂNCIAS DE FABRICAÇÃO TOLERÂNCIAS DE FUN- FUNCIONAMENTO3.0 - ESTABELECIMENTOS DAS FOLGAS PARA OS AJUSTES NORMALIZAÇÃO, CAMPOS DE TOLERÂNCIA4.0 - PRINCÍPIOS DE CONTAGEM5.0 - OS DIFERENTES PROCESSOS DE USINAGEM:TORNEAMENTO,FRESAMENTO, BROCHAMENTO, RETIFICAÇÃO, ALARGAMENTO, MANDRILHAMENTO, TAMBORAMENTO, PLAINAMENTO, ELETROEROSÃO E OUTROS6.0 - FUNCIONAMENTO E OPERAÇÃO DAS MÁQUINAS FERRAMENTAS7.0 - CONCEITOS BÁSICOS DOS MOVIMENTOS E RELAÇÕES GEOMÉTRICAS NA USINAGEM8.0 - GEOMETRIA DE CUNHA DE CORTE9.0 - MEDIDAS DE FORÇAS E POTÊNCIAS DE CORTE10.0- MATERIAIS PARA FERRAMENSTAS11.0- AVARIAS E DESGASTES12.0- FUIDOS E ÓLEOS DE CORTE13.0- VIDA DA FERRAMENTA14.0- CONDIÇÕES ECONÔMICOSDE USINAGEM15.0- ATIVIDADES DE LABORATÓRIO.",
    "32": "TRANSPORTE DE CALOR E MASSA FUNDAMENTOS DE FENÔMENOS DE TRANSPORTE.PROPRIEDADES DOS FLUIDOS E DOS MEIOS CONTÍNUOS. GASES PERFEITOS, PRIMEIRA E SEGUNDALEIS DA TEERMODINÂMICA E CICLOS OPERATIVOS. ESTÁTICA DOS FLUIDOSMANOMETRIA, ANÁLISE DE ESCOAMENTOS. LEIS BÁSICAS PARA SISTEMAS EVOLUMES DE CONTROLE . TRANSPORTE DE CALOR: FUNDAMENTOS DE CONDUÇÃO, CONVECÇÃO E RADIAÇÃO TÉRMICA. I - FUNDAMENTOS# Introdução# Fundamentos de Fenômenos de Transporte# Propriedades dos Fluidos e dos Meios Contínuos.II - TERMODINÂMICA# Gases Perfeitos, Calor e Trabalho# Primeira Lei da Termodinâmica# Entropia# Segunda Lei da termodinâmica# Ciclos operativos# Aula em Laboraatório.III- MECÂNICA DOS FLUIDOS# Estática dos Fluídos# Manometria# Aula em Laboratório - Medição de Pressão# Fundamentos da Análise de Escoamento# Leis Básicas para Sistemas e Volumes de Controle# Aula em Laboratório - Vazão e Perda de Carga.IV - MEIOS NÃO ESTACIONÁRIO# Condução de Calor Estacionário# Aula Laboratório# Condução de Calor não Estacionário# Aula em Laboratório - Medição de temperatura# Transferência de Calor por Convecção Livre# Radiação Térmica# Difusão.",
    "33": "ORGANIZAÇÃO E ARQUITETURA DE COMPUTADORES Desempenho de Processadores. Arquitetura do Conjunto de Instruções e Linguagem de Máquina. Aritmética Computacional. Organização e Projeto de Processadores (Uniciclo, Multiciclo e Pipeline). Hierarquia de Memória. Sistemas de entrada e saída. Introdução ao Multiprocessamento. Introdução- Motivação- Histórico- Arquiteturas VonNeumann x Harvard- Fabricação de CI Linguagem de Máquina- Estrutura de Hardware- Representação de Instruções- Operações Lógicas, Aritméticas, Decisão, Memória Aritmética Computacional- Representação Numérica- Adição, Subtração, Multiplicação, Divisão- Ponto Fixo e Flutuante Análise de Desempenho - Fatores determinantes- Avaliando desempenho- Benchmarks Processador- Lógica de Projeto- Projeto do Caminho de Dados- Implementação uniciclo- Implementação multiciclo Pipelining- Introdução- Caminho de Dados com Pipeline- Controle do Pipeline- Hazards Memórias- Princípios Básicos de Cache- Desempenho de Cachê- Memória Virtual- Hierarquia de Memória Armazenamento, Redes e Outros Periféricos- Armazenamento em disco e confiabilidade- Redes- Barramentos e outras conexões entre processadores, memória e dispositivos- Interface de Dispositivos Arquiteturas Multicores",
    "34": "TECNOLOGIAS DE COMANDO NUMERICO ## => CONCEITUAÇÃO DE UM SISTEMA DE COMANDO NUMÉRICO## => PRINCÍPIOS DE FUNCIONAMENTO## => SISTEMAS DE ACIONAMENTO## => CONTROLE DE POSIÇÃO, ARMAZENAMENTO DAS INFORMAÇÕES, ETC## => EQUIPAMENTOS QUE UTILIZAM SISTEMAS DE COMANDO NUMÉRICO## => DIVERSOS TIPOS DE APLICAÇÕES## => CARACTERÍSTICAS PECULIARES DOS COMPONENTES MECÂNICOS EELETRÔNICOS## => NOÇÕES DE INTERLIGAÇÃO ENTRE DIVERSOS EQUIPAMENTOS E COMSISTEMAS DE INFORMAÇÃO## => PROGRAMAÇÃO MANUAL## => PROGRAMAÇÃO ASSISTIDA POR COMPUTADOR## => APT CAD/CAM. 1.0 - ## => INTRODUÇÃO:1.1 - ## => Histórico1.2 - ## => CN e CNC1.3 - ## => Centros de Usinagem1.4 - ## => Centros de Torneamento1.5 - ## => FMC, FMS e DNC.2.0 - ## => PROGRAMAÇÃO MANUAL E ASSSITÊNCIA POR COMPUTADOR:2.1 - ## => Código G2.2 - ## => Manual2.3 - ## => Orientação por Sistemas CAD e/ou APT.3.0 - ## => ETAPAS PROGRAMAÇÃO MANUAL:3.1 - ## => Seleção das Peças3.2 - ## => Interpretação Desenho3.3 - ## => Planejamento do Processo3.4 - ## => Tecnologia de Grupo3.5 - ## => Cáculo trajetório3.6 - ## => Simulação3.7 - ## => Try-out.4.0 - ## => CONCEITOS BÁSICOS DE PROGRAMAÇÃO E OPERAÇÕES RECURSOS CN:4.1 - ## => Modos de Operações4.2 - ## => Funções de Programação.5.0 - ## => PROGRAMAÇÃO MANUAL:5.1 - ## => Estruturas do Programa5.2 - ## => Informações de Trajetória e5.3 - ## => Funções Preparatórios. 6.0 - ## => PROGRAMAÇÃO AUXILIADO POR COMPUTADOR:6.1 - ## => APT6.2 - ## => EXAPT6.3 - ## +> Sistemas CAD/CAM.OBS: EMENTA - BIBLIOGRAFIA - PROGRAMA ATUALIZADOS EM 06.07.2000",
    "35": "SISTEMAS DE MEDIÇÃO Expressão de termos metrológicos segundo o Vocabulário Internacional de Termos Gerais e Fundamentais de Metrologia. Cálculo da incerteza de medição. Características estáticas e dinâmicas dos elementos sensores de medição. Aplicação de ponte de Wheatstone, amplificadores de sinal e filtro. Elementos transdutores. Instrumentos e técnicas de medição de deslocamento, força/torque, pressão, rotação, temperatura, vazão. Aplicação prática de sistemas de medição.  Introdução aos sistemas de medição Descrição funcional de instrumentos de medição Transdutores ativos/passivos Aspectos tecnológicos envolvidos em sistemas de medição Arquitetura básica de um sistema de medição Causas de incertezas em sistemas de medição Tópicos em características estáticas de Sistemas de Medição Tópicos sobre calibração estática Exatidão, precisão e bias Sensibilidade estática Linearidade Threshold, Histeresis Uma metodologia para calibração estática Tópicos em filtragem e fusão de sensores  uma introdução à filtragem estocástica  Implementação de filtros de software em microcontroladores  Tópicos em fusão sensorial (Filtro de Kalman Linear- KF Tópicos em características dinâmicas de Sistemas de Mediçãoa) Instrumentos de ordem 0 Instrumentos de primeira ordem Resposta dinâmica de instrumentos de primeira ordem Instrumentos de segunda ordem Resposta dinâmica de instrumentos de segunda ordem Tópicos em calibração dinâmica de Sistemas de Medição Resposta à frequência aplicada a Sistemas de Medição Tópicos em análise no domínio da frequência Diagramas de Bode Tópicos e aplicações da Transformada de Fourier para Sistemas de Medição Teorema da Amostragem Instrumentos de Medição (temas a serem comentados durante o curso Fitas de medição extensométricas (strain-gages) Potenciômetros como sensores de deslocamento Termistores, termo-resistências e termopares Tópicos em transdutores Analisadores de Espectro Medição de voltagem, corrente, resistência Medição de torque e força Medição de pressão Medição de som",
    "36": "ELETRÔNICA Introdução a eletrônica. Amplificadores operacionais. Diodos de junção. Transistor de efeito de campo. Transistor de junção bipolar. Composições com transistores. Dispositivos opto-eletrônicos. Introdução a eletrônica- Relevância de eletrônica para a sociedade moderna- Evolução histórica- Principais fabricantes e sites de fornecedores- Exemplos de sistemas eletrônicos Amplificadores operacionais- Caso ideal- Caso real: limitações para entrada e saída (tensões limite para entrada/saída e amplificadores Rail-to-Rail, Slew-Rate, corrente máxima de saída, tensões e correntes de offset de entrada, resistência de entrada, resistência de saída, compensação)- Caso real: modelo de ordem zero com ganho diferencial e ganho de modo comum, definição de CMRR, modelo com ganho diferencial de primeira ordem, banda passante e sua relação com demais componentes do circuito- Realimentação positiva e realimentação negativa- Estabilidade- Análise de circuitos e considerações para projeto- Estudo de datasheets e exemplos de amplificadores operacionais comerciais comuns e especializados Diodos de junção- Junção bipolar e caracterização de diodos- Tipos de diodos (sinal, retificador, Schottky, Zenner, varicap, Tunnel)- Análise de circuitos com diodos- Análise de circuitos com diodos e amplificadores operacionais para compensação de não-linearidade ou obtenção de funções não-lineares- Projeto de fontes CC- Estudo de datasheets e exemplos de diodos comerciais comuns e especializados Transistor de efeito de campo (FET)- Princípios físicos de operação e caracterização do MOSFET- Modelos de grandes sinais e de pequenos sinais- Análise de circuitos explorando os modos de operação do MOSFET- Projeto de chaves com MOSFETs: acionamento de cargas resistivas, chave analógica e portas lógicas- Estudo de datasheets e exemplos de MOSFETs comerciais comuns e especializados Transistor de junção bipolar (TJB)- Princípios físicos de operação e caracterização do TJB- Modelos de grandes sinais e pequenos sinais- Análise de circuitos explorando os modos de operação do TJB- Análise de circuitos com TJBs e amplificadores operacionais para compensação de não-linearidade ou obtenção de funções não-lineares- Projeto de chaves com TJBs: acionamento de cargas resistivas, chave analógica e portas lógicas- Estudo de datasheets e exemplos de TJBs comerciais comuns e especializados Dispositivos opto-eletrônicos- Diodo emissor de luz (LED): princípios físicos, acionamento e diferentes tipos- Fotodiodos- Fototransistores- Opto-acopladores: dispositivos digitais, dispositivos lineares, relês de estado sólido- Análise de circuitos- Estudo de datasheets e exemplos de dispositivos comerciais comuns e especializados",
    "37": "LABORATÓRIO DE ELETRÔNICA Realização de um conjunto de experiências que exijam habilidades de projeto, montagem e teste de circuitos eletrônicos que empreguem os seguintes componentes eletrônicos: amplificadores operacionais diodos de junção transistor de efeito de campo transistor de junção bipolar dispositivos opto-eletrônicos. Ao longo do curso deverá ser realizado um conjunto de experiências que exijam habilidades de projeto, montagem e teste de circuitos eletrônicos que empreguem os seguintes componentes eletrônicos:- amplificadores operacionais - diodos de junção - transistores de efeito de campo - transistores de junção bipolar - dispositivos opto-eletrônicos.",
    "38": "CONTROLE DE SISTEMAS DINÂMICOS Modelagem de sistemas dinâmicos. Diagrama de blocos. Estabilidade. Especificação do projeto de controle. Análise por lugar geométrico das raízes. Projeto de controle por lugar geométrico das raízes. Análise por resposta em frequência. Projeto de controle por resposta em frequência. Modelagem de sistemas dinâmicos- Modelagem de circuitos elétricos, sistemas mecânicos e eletromecânicos- Linearização em ponto de operação- Função de transferência- Análise da resposta ao degrau de sistemas de 1ª e 2ª ordem.Diagramas de blocos- Representação gráfica das equações do sistema- Álgebra de diagramas de blocos.Estabilidade- Definição de estabilidade- Critério de Routh-Hurwitz.Erros de estado estacionário- Erros de estado estacionário de sistemas com retroação unitária- Constantes de erro estático e tipo do sistema- Erros de estado estacionário devido a perturbações- Erros de estado estacionário de sistemas com retroação não unitária.Técnicas do lugar geométrico das raízes- Definição do lugar geométrico das raízes- Propriedades e esboço do lugar geométrico das raízes- Projeto da resposta dinâmica- Casos especiais do lugar geométrico das raízes.Projeto por intermédio do lugar geométrico das raízes- Compensação em série para ajuste do erro de estado estacionário e da resposta transitória: projeto de compensadores em avanço, atraso, avanço-atraso e PID- Realização física da compensação.Técnicas de resposta em frequência- Conceito de resposta em frequência- Diagramas de Bode: aproximações assintóticas- Estabilidade via critério de Nyquist- Margem de ganho e margem de fase- Relação entre resposta transitória e resposta em frequência- Relação entre respostas em frequência a malha aberta e a malha fechada- Características de erro do estado estacionário a partir da resposta de frequência- Sistemas com atraso.Projeto por intermédio da resposta de frequência- Resposta transitória por intermédio do ajuste de ganho- Projeto de compensadores em avanço, atraso, avanço-atraso e PID.Métodos empíricos de sintonia de controladores- Ziegler-Nichols.",
    "39": "TRANSMISSÃO DE DADOS \tFUNDAMENTOS DA COMUNICACAO TRANSMISSAO DE DADOS ELEMENTOS DO MEIO DE TRANSMISSAO CARACTERISTICAS DO MEIO DA TRANSMISSAO ERROS NA TRANSMISSAO EQUIPAMENTOS DE COMUNICACAO DE DADOS TIPOS DE CONFIGURA-COES EM COMUNICACAO DE DADOS ARQUITETURAS DE REDES DE COMPUTADOR PROTOCOLOS DE NIVEL DE ENLACE E DE REDE SERVICOS DE COMUNICACAO DE DADOS. PROTOCOLOS DE APLICAÇÕES INDUSTRIAIS. 01. FUNDAMENTOS DA COMUNICACAO 1.1. CONCEITOS BASICOS: CONFIGURACAO BASICA DE UMA REDE DE TP 1.2. SINAIS ANALOGICOS E DIGITAIS 1.3. MODULACAO 1.4. CODIFICACAO BANDA BASE 1.5. CODIGOS 02. TRANSFERENCIA DE DADOS 2.1. MODOS DE OPERACAO: SIMPLEX, HALF-DIPLEX E FULL-DUPLEX 2.2. MODOS DE TRANSMISSAO: SERIAL E PARALELAS 2.3. INTERFACES SERIAL E PARALELA 2.4. TRANSMISSAO ASSINCRONA E SINCRONA 03. ELEMENTOS DO MEIO DE TRANSMISSAO 3.1. LINHAS PRIVATIVAS DE COMUNICACAO DE DADOS 3.2. MULTIPLEXADORES: FDM, TDM, PCM 04. CARACTERISTICAS DO MEIO DE TRANSMISSAO 4.1. MEIOS DE TRANSMISSAO: TECNOLOGIAS DISPONIVEIS NO MERCADO 4.2. PARAMETROS DE RESISTENCIA, ISOLACAO, RUIDO, ATENUACAO 4.3. FATORES DE DEGRADACAO. 05. ERROS NA TRANSMISSAO DE DADOS 5.1. METODOS DE DETECCAO DE ERROS 5.2. EFICIENCIA E ANALISE 06. MODEM 6.1. MODEM ANALOGICO, DIGITAL E OTICO 6.2. NORMALIZACAO DE MODEMS 6.3. ESCOLHA DE MODEMS. 07. EQUIPAMENTOS DE COMUNICACAO DE DADOS 7.1. UNIDADE DE DERIVACAO DIGITAL E ANALOGICA 7.2. MULTIPLEXADORES 7.3. CONVERSOR/CONCENTRADOR. 08. TIPOS DE CONFIGURACOES EM COMUNICACAO DE DADOS 8.1. LIGACAO PONTO A PONTO DEDICADA, RADIAL E COMUTADA 8.2. LIGACAO MULTIPONTO COM UDD, UDA, MULTIPLEXADOR TDM E CONVERSO- RES/CONCENTRADORES. 09. ARQUITETURAS DE REDES DE COMUNICACAO DE DADOS 9.1. MODELO OSI: CAMADAS E FUNCOES 9.2. CONTROLE DE LINHA: POLLING E SELECTION 9.3. PROTOCOLOS DE NIVEL DE ENLACE: BSC, HDLC, SDLC, X.25 9.4. NIVEL DE REDE: SERVICO DE CIRCUITO VIRTUAL E DATAGRAMA 9.5. PROTOCOLO X.25, NIVEL DE REDE 10. SERVICO DE COMUNICACAO DE DADOS 10.1. SERVICOS TRANSDATA, RENPAC, INTERDATA, VIA SATELITE EM ALTA VELOCIDADE, VIDEO-TEXTO, RDSI. 11. PROTOCOLOS DE APLICAÇÕES INDUSTRIAIS",
    "40": "SOFTWARE BASICO Linguagem de montagem montadores, ligadores e carregadores controladores de dispositivos 1. PROGRAMACAO EM LINGUAGEM DE MAQUINA. 1.1 INTRODUCAO 1.2 CARACTERISITICAS DAS LINGUAGENS DE BAIXO NIVEL 1.3 DEPURACAO E CALCULO ARITMETICO 1.4 SUBPROGRAMAS E RECURSAO 1.5 ENTRADAS E SAIDAS. 2. SISTEMAS BASICOS. 2.1 NIVEL DE COMANDO DO SISTEMA 2.2 SUPORTE EM TEMPO DE EXECUCAO 2.3 MONTADORES 2.4 LIGADORES 2.5 CARREGADORES DE RELOCACAO 2.6 PROCEDIMENTO DE INICIALIZACAO 2.7 TRATAMENTO DE MACROS.",
    "41": "SISTEMAS HIDRAULICOS E PNEUMATICOS Os PRINCIPIOS DE FUNCIONAMENTO DE COMPONENTES DOS CIRCUITOS HIDRAULICOSE PNEUMATICOS, BOMBAS, VALVULAS, ATUADORES E RESERVATORIOS. CANALIZACAO:CONSIDERACOES SOBRE SELECAO DE CANOS. TUBOS E CONEXOES, PROJETOS DEMECANISMOS HIDRAULICOS E PNEUMATICOS. MECANISMOS HIDRAULICOS ESPECIAIS. Objetivo da disciplina: Capacitar ao aluno a: 1. Efetuar leitura e interpretação de texto de plantas de sistemas eletro-hidráulicos e eletro-pneumáticos 2. Selecionar adequadamente os componentes sistemas fluidos de potência3. Elaborar projetos de automação fluida com e sem controle elétrico4. Utilizar montagem pratica de sistemas de automação fluida5. Dimensionar e selecionar os componentes do sistema. 1. Introdução Apresentação do plano de Disciplina Revisão de princípios básicos de Hidráulica e Pneumática Apresentação da Estrutura e Componentes de um sistema de Potência Fluida 2. Componentes de sistemas de Sistemas de Potência Fluida (Classificação, Principio de Funcionamento e Aplicações). a) Atuadores: Cilindricos motores Hidráulicos Atuadores Especiais. b) Válvulas: Reguladoras de Pressão e Vazão de Controle Direcional. c) Reservatórios, Canalização e Acessórios. d) Bombas e Compressores.3. Simbologia: Normas Internacionais, exercícios de Leitura de pLantas.4. Sistemas Puramente Fluidos.5. Adionamento Elétrico: Componentes do Circuito Elértrico e Sensores.6. Circuitos Fluido-Elétricos para Controle a Reles: a) Concepção b) Simulação e c) Montagem.7. Dimensionamento e Seleção de Componentes.8. Elaboração de Projetos Integrador.",
    "42": "SISTEMAS INTEGRADOS DE MANUFATURA ### A VISÃO INTEGRADA DA AUTOMAÇÃO INDUSTRIAL.### OS DIFERENTES SUB-SISTEMAS DO CIM: GESTÃO HIERARQUIZADA, COMUNICAÇÃO, INTERFASES E SUB-SISTEMA FÍSICO.### O SUB-SISTEMA FÍSICO: CARACTERIZAÇÃO DE COMPONENTES, EQUIPAMENTOS DE TRANSPORTES E MANUSEIO.### O SISTEMA TRANSPORTE COMO ELEMENTOS DE INTEGRAÇÃO.### CÉLULAS E SISTEMAS FLEXÍVEIS DE MANUFATURA: SUA SITUAÇÃO NO CIM, DIFERENTES CONFIGURAÇÕES (lay-out, sist. de transporte, filosofia de operação).### CONTROLE DE FMS's: O NÍVEL DE SUPERVISÃO/MONITORAÇÃO(MÉTO-DOS E FERRAMENTAS).### A AUTOMATIZAÇÃO INTEGRADA DOS SISTEMAS DE MANUFATURA: MÉTO-DOS E FERRAMENTAS. 1.0 - Modelo de Referência para Manufatura Integrada por Computador.2.0 - Definições: Peças, Unidade, FMC/FMS, CAE/CAD, CAM, CAP, CAPP, CAQ, CIM.3.0 - Planejamento de Produto: Projeto e Engenharia, CAE/CAD, Padronização, Soluções de Mercado.4.0 - Planejamento do Processo: CAPP, Tecnologia de Grupo, Integração CAD/GT/CAPP.5.0 - Planejamento e Controle da Produção: Sistemas Pull X Pull, MRP II, OPT, JIT.6.0 - CAM: Fase de Planejamento e Fase de Exercução (Controle).7.0 - CAQ: Garantia da qualidade, CAQ no Contexto do CIM.8.0 - Contexto de Chão de Fábrica: FMc, FMS, Integração, Padronização.9.0 - Base de Dados.10 - Aspectos de Comunicação de Dados e LAN: Protocolo MAP/TOP, Modelo de Referência: OSI.EMENTA/BIBLIOGRAFIA/PROGRAMA ATUALIZADOS EM 26.04.2000",
    "43": " LABORATÓRIO DE CONTROLE DE SISTEMAS DINÂMICOS \tFerramentas computacionais. Modelagem de sistemas físicos. Análise de resposta no domínio do tempo e no domínio da frequência. Projeto de compensadores. Ferramentas computacionais:- Simulação de sistemas dinâmicos.Modelagem de sistemas físicos:- Obtenção de equações diferenciais e funções de transferência de partes de sistemas físicos, diagramas de blocos.Análise de resposta no domínio do tempo e no domínio da frequência:- Resposta transitória de sistemas de 1ª e 2ª ordem, identificação de parâmetros, erro estacionário- Verificação do funcionamento de sistemas físicos submetidos a sinais senoidais- Análise de estabilidade. Projeto de compensadores:- Projeto por intermédio da técnica do Lugar das Raízes- Projeto por intermédio da técnica de resposta em frequência- Sintonia de compensadores PID.",
    "44": "CONTROLE NO ESPAÇO DE ESTADOS \tRevisão de álgebra linear. Descrição matemática de sistemas. Estabilidade. Controlabilidade e observabilidade. Representações no espaço de estados. Realimentação de estados. Observabilidade e injeção da saída. Tópicos de controle avançado. Revisão de álgebra linear- Espaços vetoriais- Dependência linear, bases e coordenadas- Transformação linear- Representação matricial de transformações lineares- Transformação de similaridade- Sistemas de equações algébricas lineares- Autovalores e autovetores- Diagonalização- Funções de matrizes Descrição matemática de sistemas- Descrição no espaço de estados de sistemas lineares e não lineares, variantes e invariantes no tempo, com uma entrada e uma saída e com múltiplas entradas e múltiplas saídas- Linearização- Solução das equações de estados de sistemas lineares invariantes no tempo- Equações de estados equivalentes Estabilidade- Estabilidade entrada/saída de sistemas- Estabilidade interna de sistemas- Teorema de Lyapunov Controlabilidade e observabilidade- Controlabilidade- Observabilidade- Dualidade- Decomposição canônica Representações no espaço de estados- Realização de funções de transferência- Forma canônica controlável- Forma canônica observável- Decomposição de Kalman- Realizações de ordem mínima- Realização de matrizes de transferência Realimentação de estados- Realimentação de estados de sistemas com uma entrada e uma saída e com múltiplas entradas e múltiplas saídas- Métodos de Ackerman e Bass Gura- Função de transferência a malha fechada- Estabilizabilidade e alocação de polos- Regulação e rastreamento- Rejeição de perturbações com canal integral- Regulador Linear Quadrático Observadores de estado e injeção da saída- Observadores de estado de sistemas com uma entrada e uma saída e com múltiplas entradas e múltiplas saídas- Detectabilidade e alocação de polos- Princípio da separação- Configuração controlador/observador- Regulador Linear Gaussiano- Observador com rejeição de perturbaçãoTópicos de controle avançado- Noções de controle robusto, ótimo, adaptativo ou preditivo",
    "45": "PROCESSAMENTO EM TEMPO REAL Introdução. Características, abstração e modelagem de Sistemas em Tempo Real. Projeto e implementação de Sistemas em Tempo Real. Sistemas Operacionais de Tempo Real. 1. Introdução Sistemas de Tempo Real Características Exemplos 2. Relógios e tempo real Relógios Modelagem do tempo Relógios ideais Relógios reais Intervalos de tempo Intervalos de tempo real Intervalos de tempo de relógio Relações entre intervalos de tempo. Abstração e modelagem CSP ? Communicating Sequencial Processes Eventos e processos Operadores Concorrência 4. Projeto e implementação Partição de software Módulos e tarefas Ativação e ex equibilidade Esquemas de partição Alocação de tarefas Parâmetros do sistema Parâmetros da aplicação Abordagem gráfica 5. Escalonamento Escalonamento em sistemas multiprocessados Escalonamento estático em sistemas multiprocessados Escalonamento dinâmico em sistemas multiprocessados",
    "46": "CIENCIAS DO AMBIENTE A BIOSFERA E SEU EQUILÍBRIO. EFEITOS DA TECNOLOGIA SOBRE O EQUILÍ- BRIO ECOLÓGICO. PRESERVAÇÃO DOS RECURSOS NATURAIS. LEGISLAÇÃO AMBIENTAL. Cronograma Aula 1 - Introdução ao curso Aula 2 - A energia no ecossistema Aula 3 - Ciclos Bio geo quimicos Aula 4 - Uso do solo: mineração, agricultura, pecuária Aula 5 - Biodiversidade de Espécies Aula 6 - Extinção de epécies Aula 7 - Aula 8 - Resíduos sólidos - lixo Aula 9 - Poluição do Solo Aula 10 - Poluição das águas Aula 11 - Poluição do ar Aula 12 - Legislação ambiental brasileira: acordos Internacionais Aula 13 - Desenvolvimento Sustentável Aula 14 - Pegada ecológica e consequências - soluções",
    "47": "CONTROLE DIGITAL SISTEMAS DISCRETOS. REPRESENTACAO DA DINAMICA DE SISTEMAS DISCRE- TOS. SISTEMAS COM DADOS AMOSTRADOS. CONTROLE DE SISTEMAS LINEARES DIS- CRETOS: DOMINIO-K, DOMINIO-Z, ESPACO DE ESTADOS. PROJETO E COMPENSACAO NO CONTROLE DE SISTEMAS LINEARES DISCRETOS. SISTEMAS DISCRETOS. REPRESENTACAO DA DINAMICA DE SISTEMAS DISCRETOS: SEQUENCIA DE PONDERACAO. FUNCAO DE TRANSFERENCIA DISCRETA, EQUACAO DE ESTADO DISCRETO. SISTEMAS COM DADOS AMOSTRADOS: AMOSTRAGEM, RETENCAO. CONTROLE POR COMPUTADOR. MODELO DISCRETO DE SISTEMAS AMOSTRADOS. CONTROLE DE SISTEMAS LINEARES DISCRETOS: SOLUCAO DAS EQUACOES DE DIFERENCA. ESTABILIDADE, DESEMPENHO DINAMICO. DOMINIO-K: SOMATORIO DE CONVOLUCAO. DOMINIO-Z: METODO DO LUGAR GEOMETRICO DA RAIZES. DOMINIO-V: METODOS DA RESPOSTA EM FREQUENCIA. ESPACO DE ESTADOS: CONTROLABILIDADE, OBSERVABILIDADE. PROJETO E COMPENSACAO NO CONTROLE DE SISTEMAS LINEARES DISCRETOS: ESTRUTURAS DE COMPENSACAO. COMPENSACAO PELO EQUIVALENTE DISCRETO NO DO- MINIO-S NO DOMINIO-V. COMPENSACAO NO DOMINIO-Z. ALOCACAO DE POLOS COM REALIMENTACAO DE ESTADO E ESTIMACAO DE ESTADO.",
    "48": "INSTRUMENTACAO DE CONTROLE ### ESTRUTURA GERAL DE UM SISTEMA DE MEDIÇÃO E SEUS ELEMENTOS TÍPICOS.### ELEMENTOS SENSORES.### ELEMENTOS DE CONDICIONAMENTO DE SINAIS.### ELEMENTOS DE PROCESSAMENTO DE SINAIS.### ELEMENTOS DE APRESENTAÇÃO DE DADOS.### CONTROLADORES.### ACIONAMENTOS E APLICAÇÕES EM SISTEMAS DE CONTROLE. 1.0 - ESTRUTURA GERAL DE UM SISTEMA DE MEDIÇÃO### Sensores.### Condicionadores de sinais.### Processamento de sinais.### Apresentação ou uso quantidades medidas.2.0 - CARACTERÍSTICAS ESTÁTICAS DOS ELEMENTOS DE UM SISTEMA DE MEDIÇÃO ### Características sistemáticas.### Modelo Geral.### Calibração.3.0 - CARACTERÍSTICAS DINÂMICAS DOS ELEMENTOS DE UM SISTEMA DE MEDIÇÃO### Função de transferência.### Identificação dinâmica.4.0 - INTERFERÊNCIAS EM CIRCUITOS DE MEDIÇÃO5.0 - ELEMENTOS SENSORES### Sensores resistivos.### Capacitivos.### Indutivos.### Termométricos.### Eletromagnéticos.### Elásticos.### Piezo elétricos.6.0 - ELEMENTOS DE CONDICIONAMENTO DE SINAIS### Pontes de deflexão.### Amplificadores.### Filtros.7.0 - ELEMENTOS DE PROCESSAMENTO DE SINAIS### Conversor digital-analógico.### Consersor analógico-digital.### Microcomputador.### Microcontrolador.### DSP e CLP.8.0 - ELEMENTOS DE APRESENTAÇÃO DE DADOS### Indicadores analógicos e digitais.### Gravadores (registradores) analógicos e digitais.9.0 - CONTROLES E ACIONAMENTO### Implementação de controladores analógicos (elétricos e eletrônicos).### Atuadores em processos.### Acionamentos eletrônicos.### Acionamentos eletromecânicos.10 - EXPERIÊNCIA DE LABORATÓRIO COM USO DE METODOLOGIA",
    "49": "ORGANIZAÇÃO INDUSTRIAL Maturidade e valor em sistemas de produção. Estratégia de produção. Modelos de produção. Gestão da cadeia de suprimento. Custos e formação de preços. Engenharia econômica. Gestão da qualidade. Gestão de projetos. Planejamento e controle da produção. a. MATURIDADE E VALOR EM SISTEMAS DE PRODUÇÃO: Valorização em sistemas de produção. Posicionamentos tempo-espaço em trajetórias de excelência, em diversos espaços de valorização, sob diferentes perspectivas de tempo .b. ESTRATÉGIA DE PRODUÇÃO: Estratégia corporativa, vantagem competitiva, forças que moldam a competição na indústria, cadeia de valor, implementação da estratégia, balanced scorecard, mapa estratégico, estratégias funcionais, estratégia de produção/operações, sistema americano/sistema japonês, conteúdo e processo da estratégia de produção, fatores competitivos e objetivos de desempenho, dimensões competitivas da produção, trade-offs, decisões na estratégia de produção e alternativas estratégicas: CKD.c. MODELOS DE PRODUÇÃO: Revolução industrial, processo de industrialização no Brasil, política industrial brasileira, setores industriais, indústria de serviços, sistemas de produção, modelos de industrialização e produção, o modelo Toyota, produção enxuta, sincronização enxuta, clusters.d. GESTÃO DA CADEIA DE SUPRIMENTO: Conceitos e tipos de cadeias de suprimentos. Modelos para o gerenciamento da cadeia de suprimentos. Sistemas de informação para gestão da cadeia de suprimentos.e. CUSTOS E FORMAÇÃO DE PREÇOS: Custos na indústria e nos serviços. Despesas operacionais. Ponto de equilíbrio. Custeio baseado em atividades.f. ENGENHARIA ECONÔMICA: Conceitos de Matemática Financeira. Comparação de alternativas de investimento e financiamento de projetos utilizando valor presente líquido, taxa interna de retorno, conceitos de depreciação e substituição de equipamentos.g. GESTÃO DA QUALIDADE: Conceituação de qualidade. Ferramentas de qualidade: histogramas, diagramas de causa e efeito, diagramas de pareto, folhas de verificação, gráficos lineares, diagramas de dispersão e fluxogramas. Avaliação da qualidade por atributos ou por variáveis. Custos da qualidade: prevenção, inspeção, falhas internas e falhas externas. Controle estatístico de processos. Confiabilidade, manutenibilidade e disponibilidade. Famílias ISO de normas de qualidade: ISO 9000, ISO 14000 e ISO 26000. h. GESTÃO DE PROJETOS: Guias de melhores práticas. Redes de projeto. Determinação de caminhos críticos. Custos e otimização em redes de projetos. Cronograma físico-financeiro de projetos.i. PLANEJAMENTO E CONTROLE DA PRODUÇÃO: Planejamento da capacidade. Estoques. Localização das instalações. Projeto do produto e processo. Arranjo físico de instalações. Projeto e medida do trabalho.",
    "50": "CONTROLE PARA AUTOMAÇÃO TEORIA: Introdução aos Sistemas a Eventos Discretos, Aplicações para Automação de Processos. Estruturas dos Sistemas de Controle: Processos a Eventos Discretos, Controladores Programáveis. Modelamento das Tarefas de Controle: Descrição do Algoritmo de Controle, Diagramas de Relés. Representação de Sistemas a Eventos Discretos por Redes de Petri. Desenvolvimento do Controle de Sistemas a Eventos Discretos utilizando as Redes de Petri. Metodologias de Projeto de Sistemas de Controle.LABORATÓRIO: Experiências e Métodos Computacionais no Controle de Sistemas a Eventos Discretos TEORIA INTRODUÇÃO AOS SISTEMAS A EVENTOS DISCRETOS: Sistemas de Variáveis Contínuas, Sistemas a Eventos Discretos. Histórico dos Sistemas a Eventos Discretos: Controladores por Comutação Elétrica (relés), Controladores por Comutação Eletrônica, Controladores Lógico Programáveis, Controladores Programáveis. Elementos do Controle de um Sistema a Eventos Discretos. ESTRUTURA DOS SISTEMAS DE CONTROLE: Controle de Sistemas de Variáveis Contínuas, Controle de Sistemas a Eventos Discretos. Características dos Processos Controlados, Controle Local e Distribuído. Representação Matemática dos Controladores Programáveis no espaço de estados discretos. Representação Matemática de um Processo a Eventos Discretos Controlado. Processamento Lógico de Eventos Discretos: lógica combinacional, manutenção de estados, detecção de mudança de estados, processamento temporizado, intertravamento.REPRESENTAÇÃO DAS TAREFAS DE CONTROLE: Descrição do Algoritmo de Controle. Diagrama de Relés ( LD - ladder diagram): elementos, diagramas e funções de controle, representação matricial. Linguagens Padronizadas: textuais, gráficas e tabulares elementos funções linguagem de máquina e linguagem de controle. REPRESENTAÇÃO DOS SISTEMAS A EVENTOS DISCRETOS POR REDES DE PETRI: Coceitos Gerais. Redes Condição-Evento. Redes Lugar-Transição. Redes de Marcas Individuais (redes coloridas). Redes de Petri e o Controle de Sistemas a Eventos Discretos. DESENVOLVIMENTO DO CONTROLE POR REDES DE PETRI: Esquema do Fluxo de Produção (PFS - production flow schema). Gráfico do Fluxo de Marcas (MFG - mark flow graph). Metodologia PFS/MFGMETODOLOGIAS E PROJETO DE SISTEMAS DE CONTROLE: Análise de Necessidades. Definição de Necessidades. Projeto de Sistemas de Controle. Projeto e Programação do Algoritmo de Controle. Desenvolvimento do Programa de Controle e Testes.LABORATÓRIO EXPERIÊNCIAS E MÉTODOS COMPUTACIONAIS NO CONTROLE DE SISTEMAS A EVENTOS DISCRETOS",
    "51": "TRABALHO DE GRADUAÇÃO 1 O Projeto Final de Curso, é uma atividade integradora de conhecimentos obrigatória do Curso de Engenharia Mecatrônica que visa propiciar ao aluno a capacidade de investigação e resolução de problemas em engenharia de maneira global e objetiva, o aprimoramento de sua habilidade para elaboração de documentos técnicos e de sua capacidade de expressão oral em público. A carga horária do Projeto Final de Curso será integralizada pelo estudante por meio de dois componentes curriculares do tipo atividade. O Regulamento de Projeto Final do Projeto Pedagógico do Curso de Engenharia Mecatrônica descreve as regras para matrícula, desenvolvimento e avaliação nestes componentes curriculares. ",
    "52": "ESTÁGIO CURRICULAR EM ENGENHARIA MECATRÔNICA O estágio curricular possibilita aprendizagem social, profissional e cultural, e é considerado essencial à formação do Engenheiro. O Curso de Engenharia Mecatrônica prevê o estágio de forma obrigatória, que deve ser acompanhado na forma de componente curricular do tipo atividade, para que o aluno integralize um total de 180 horas. O Regulamento de Estágio do Projeto Pedagógico do Curso de Engenharia Mecatrônica descreve as regras para matrícula, desenvolvimento e avaliação do estudante neste componente curricular. ",
    "53": "TRABALHO DE GRADUAÇÃO 2 O Projeto Final de Curso, é uma atividade integradora de conhecimentos obrigatória do Curso de Engenharia Mecatrônica que visa propiciar ao aluno a capacidade de investigação e resolução de problemas em engenharia de maneira global e objetiva, o aprimoramento de sua habilidade para elaboração de documentos técnicos e de sua capacidade de expressão oral em público. A carga horária do Projeto Final de Curso será integralizada pelo estudante por meio de dois componentes curriculares do tipo atividade. O Regulamento de Projeto Final do Projeto Pedagógico do Curso de Engenharia Mecatrônica descreve as regras para matrícula, desenvolvimento e avaliação nestes componentes curriculares. ",
    "54": "INTRODUÇÃO À ADMINISTRAÇÃO Conceitos de Administração. As finalidades da Administração. Administração e as organizações. Evolução do pensamento e da Teoria Administrativa. Abordagem crítica do pensamento administrativo. Funções da Administração: planejamento, organização, execução, liderança e controle. Áreas funcionais da Administração. Papéis, competências e atuação profissional em administração. Administração no contexto brasileiro. Administração na sociedade contemporânea. Ética e Diversidade nas organizações. 1. Definição de administração. O papel dos gerentes.2. Os administradores e o ambiente externo.3. Evolução do pensamento e da Teoria Administrativa4. O planejamento eficaz.5. Compreendendo a função organização.6. Poder e liderança.7. Controle organizacional.8. Enfoque crítico das organizações.9. Processo decisório e resolução de problemas.",
    "55": "INTRODUÇÃO À ECONOMIA Discute-se, em caráter introdutório, questões metodológicas da ciência econômica, abordando, em seguintes temas: noções de microeconomia, estruturas de mercado, a demanda e a oferta; noções de macroeconomia, os agregados macroeconômicos, os modelos macroeconômicos simplificados; noções de economia monetária, as diferentes interpretações da inflação e políticas de estabilização; as relações econômicas internacionais, taxa de câmbio, balanço de pagamento, relações econômicas do Brasil com o resto do mundo e principais problemas atuais. No curso, apresentam-se conceitos e instrumentos de análise básicos da Economia, objetivando capacitar o estudante a melhor compreender os fenômenos econômicos da realidade que o cerca. São discutidos tanto aspectos relacionados ao comportamento e interação de agentes econômicos individuais (pessoas, empresas, o governo) - ou seja, à abordagem microeconômica -, quanto elementos de uma análise em perspectiva agregada, envolvendo o sistema econômico como um todo - a abordagem macroeconômica. Sempre que pertinente, destacam-se as características próprias do caso brasileiro, assim como o meio histórico e social em que se insere o pensamento econômico.- Unidade I - Introdução. A teoria econômica: objeto. Economia \"positiva\": a hipótese do comportamento maximizador. Alocação de recursos escassos e eficiência. Custos de Oportunidade. Vantagens comparativas e ganhos com comércio. Economia \"normativa\" e juízos de valor. Escolha social: decisões de mercado e decisões centralizadas. - Unidade II - Sistema de Preços. Teoria elementar da demanda e oferta de bens e serviços. Comportamento competitivo; o modelo de concorrência perfeita; determinação de preços em concorrência; o conceito de equilíbrio de mercado. Elasticidades. Estruturas de mercado. Falhas de Mercado: a ideia de externalidades, o conceito de bem público e o governo como agente regulador. - Unidade III - Contas Nacionais. A mensuração da atividade econômica. Produto e renda. A despesa global e seus componentes. Comparações internacionais de nível de renda. Comparações no tempo: o problema do deflacionamento. Índices de preços. - Unidade IV - Noções de Economia Monetária. Funções e história da moeda. O sistema bancário e a criação de moeda. Banco Central e controle da oferta monetária. Sistema financeiro no Brasil. Inflação; efeitos; o debate sobre suas causas. - Unidade V - Noções de Macroeconomia. A economia no longo prazo; produto potencial e produto efetivo. Crescimento econômico; poupança, investimento e o papel do sistema financeiro. A economia no curto prazo; flutuações do produto e renda. A visão \"clássica\" e a keynesiana. Política fiscal: efeitos, instrumentos. Desemprego keynesiano. Outras causas de desemprego. - Unidade VI - Noções de Economia Internacional. Relações econômicas internacionais. O balanço de pagamentos. A taxa de câmbio. Evolução recente do balanço de pagamentos e da política cambial no Brasil. Comércio internacional e vantagens comparativas; livre comércio e protecionismo. O processo de globalização. - Unidade VII - Distribuição de Renda e Tópicos de Economia Brasileira. Distribuição pessoal da renda. Desigualdade distributiva e seus Indicadores. Distribuição de renda no Brasil: evolução, fatores que a influenciam. A experiência inflacionária brasileira e os planos de estabilização. O Plano Real. As perspectivas atuais da economia brasileira. eal. As perspectivas atuais da economia brasileira.",
    "56": "INTRODUÇÃO À SOCIOLOGIA Introduzir a Sociologia tanto como produto dos processos de modernização como produtora de um discurso sobre a modernidade. Apresentar as contribuições centrais dos clássicos para o pensamento sociológico, assim como as suas concepções particulares sobre o capitalismo e os tempos modernos. Discutir os contrastes históricos entre centro e periferia e a tentativa da sociologia latino-americana e brasileira de explicar a particularidade do subdesenvolvimento, do capitalismo dependente e da modernização periférica. Pensar o mundo contemporâneo através do debate sobre Desigualdade e Diferença (Identidade), Redistribuição e Reconhecimento. ",
    "57": "NOÇÕES DE DIREITO VISAO GERAL DO DIREITO. CONCEITOS BASICOS. 01. DIREITO. ORIGENS. O DIREITO COMO REGULADOR DA VIDA SOCIAL. NORMAS SOCIAIS. MORAL. EQUIDADE E JUSTICA. 02. DIREITO OBJETIVO. DIREITO SUBJETIVO. RELACAO JURIDICA. SUJEITO DE DIREITO. OBJETO DE DIREITO. 03. DIREITO PUBLICO E PRIVADO. CONCEITO E SUB-DIVISOES. 04. DIREITO CIVIL. CAPACIDADE. PERSONALIDADE. DOS FATOS JURIDICOS. DIREITO DE FAMILIA E SUCESSOES. 05. DIREITO COMERCIAL. COMERCIANTE. ATO DE COMERCIO. SOCIEDADES CO- MERCIANTE. ATO DE COMERCIO. SOCIEDADES COMERCIAIS. TITULOS DE CREDITO. 06. DIREITO CONSTITUCIONAL. ESTADO E SOCIEDADE. METODOLOGIA. O ORDE- NAMENTO JURIDICO COMO SISTEMA. NACIONALIDADE. DIREITOS POLITICOS. DOS DIREITOS E GARANTIAS INDIVIDUAIS. 07. DIREITO PENAL. ANTIJURIDICIDADE. CAUSAS DE JUSTIFICACAO. TIPO CULPABILIDADE. PENA. 08. DIREITO ADMINISTRATIVO. LECITACAO. 09. REGULAMENTACAO DO EXERCICIO DA ENGENHARIA. 10. O DIREITO DE CONSTRUIR."
}